espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Version Register */
/** Type of ver_date register
 *  version control register
 */
typedef union {
    struct {
        /** ver_data : R/W; bitpos: [31:0]; default: 539035144;
         *  csv version
         */
        uint32_t ver_data:32;
    };
    uint32_t val;
} isp_ver_date_reg_t;


/** Group: Configuration Registers */
/** Type of clk_en register
 *  isp clk control register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  this bit configures the clk force on of isp reg. 0: disable, 1: enable
         */
        uint32_t clk_en:1;
        /** clk_blc_force_on : R/W; bitpos: [1]; default: 0;
         *  this bit configures the clk force on of blc. 0: disable, 1: enable
         */
        uint32_t clk_blc_force_on:1;
        /** clk_dpc_force_on : R/W; bitpos: [2]; default: 0;
         *  this bit configures the clk force on of dpc. 0: disable, 1: enable
         */
        uint32_t clk_dpc_force_on:1;
        /** clk_bf_force_on : R/W; bitpos: [3]; default: 0;
         *  this bit configures the clk force on of bf. 0: disable, 1: enable
         */
        uint32_t clk_bf_force_on:1;
        /** clk_lsc_force_on : R/W; bitpos: [4]; default: 0;
         *  this bit configures the clk force on of lsc. 0: disable, 1: enable
         */
        uint32_t clk_lsc_force_on:1;
        /** clk_demosaic_force_on : R/W; bitpos: [5]; default: 0;
         *  this bit configures the clk force on of demosaic. 0: disable, 1: enable
         */
        uint32_t clk_demosaic_force_on:1;
        /** clk_median_force_on : R/W; bitpos: [6]; default: 0;
         *  this bit configures the clk force on of median. 0: disable, 1: enable
         */
        uint32_t clk_median_force_on:1;
        /** clk_ccm_force_on : R/W; bitpos: [7]; default: 0;
         *  this bit configures the clk force on of ccm. 0: disable, 1: enable
         */
        uint32_t clk_ccm_force_on:1;
        /** clk_gamma_force_on : R/W; bitpos: [8]; default: 0;
         *  this bit configures the clk force on of gamma. 0: disable, 1: enable
         */
        uint32_t clk_gamma_force_on:1;
        /** clk_rgb2yuv_force_on : R/W; bitpos: [9]; default: 0;
         *  this bit configures the clk force on of rgb2yuv. 0: disable, 1: enable
         */
        uint32_t clk_rgb2yuv_force_on:1;
        /** clk_sharp_force_on : R/W; bitpos: [10]; default: 0;
         *  this bit configures the clk force on of sharp. 0: disable, 1: enable
         */
        uint32_t clk_sharp_force_on:1;
        /** clk_color_force_on : R/W; bitpos: [11]; default: 0;
         *  this bit configures the clk force on of color. 0: disable, 1: enable
         */
        uint32_t clk_color_force_on:1;
        /** clk_yuv2rgb_force_on : R/W; bitpos: [12]; default: 0;
         *  this bit configures the clk force on of yuv2rgb. 0: disable, 1: enable
         */
        uint32_t clk_yuv2rgb_force_on:1;
        /** clk_ae_force_on : R/W; bitpos: [13]; default: 0;
         *  this bit configures the clk force on of ae. 0: disable, 1: enable
         */
        uint32_t clk_ae_force_on:1;
        /** clk_af_force_on : R/W; bitpos: [14]; default: 0;
         *  this bit configures the clk force on of af. 0: disable, 1: enable
         */
        uint32_t clk_af_force_on:1;
        /** clk_awb_force_on : R/W; bitpos: [15]; default: 0;
         *  this bit configures the clk force on of awb. 0: disable, 1: enable
         */
        uint32_t clk_awb_force_on:1;
        /** clk_hist_force_on : R/W; bitpos: [16]; default: 0;
         *  this bit configures the clk force on of hist. 0: disable, 1: enable
         */
        uint32_t clk_hist_force_on:1;
        /** clk_mipi_idi_force_on : R/W; bitpos: [17]; default: 0;
         *  this bit configures the clk force on of mipi idi input. 0: disable, 1: enable
         */
        uint32_t clk_mipi_idi_force_on:1;
        /** isp_mem_clk_force_on : R/W; bitpos: [18]; default: 0;
         *  this bit configures the clk force on of all isp memory. 0: disable, 1: enable
         */
        uint32_t isp_mem_clk_force_on:1;
        /** clk_crop_force_on : R/W; bitpos: [19]; default: 0;
         *  this bit configures the clk force on of crop. 0: disable, 1: enable
         */
        uint32_t clk_crop_force_on:1;
        /** clk_wbg_force_on : R/W; bitpos: [20]; default: 0;
         *  this bit configures the clk force on of wbg. 0: disable, 1: enable
         */
        uint32_t clk_wbg_force_on:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} isp_clk_en_reg_t;

/** Type of cntl register
 *  isp module enable control register
 */
typedef union {
    struct {
        /** mipi_data_en : R/W; bitpos: [0]; default: 0;
         *  this bit configures mipi input data enable. 0: disable, 1: enable
         */
        uint32_t mipi_data_en:1;
        /** isp_en : R/W; bitpos: [1]; default: 1;
         *  this bit configures isp global enable. 0: disable, 1: enable
         */
        uint32_t isp_en:1;
        /** blc_en : R/W; bitpos: [2]; default: 0;
         *  this bit configures blc enable. 0: disable, 1: enable
         */
        uint32_t blc_en:1;
        /** dpc_en : R/W; bitpos: [3]; default: 0;
         *  this bit configures dpc enable. 0: disable, 1: enable
         */
        uint32_t dpc_en:1;
        /** bf_en : R/W; bitpos: [4]; default: 0;
         *  this bit configures bf enable. 0: disable, 1: enable
         */
        uint32_t bf_en:1;
        /** lsc_en : R/W; bitpos: [5]; default: 0;
         *  this bit configures lsc enable. 0: disable, 1: enable
         */
        uint32_t lsc_en:1;
        /** demosaic_en : R/W; bitpos: [6]; default: 1;
         *  this bit configures demosaic enable. 0: disable, 1: enable
         */
        uint32_t demosaic_en:1;
        /** median_en : R/W; bitpos: [7]; default: 0;
         *  this bit configures median enable. 0: disable, 1: enable
         */
        uint32_t median_en:1;
        /** ccm_en : R/W; bitpos: [8]; default: 0;
         *  this bit configures ccm enable. 0: disable, 1: enable
         */
        uint32_t ccm_en:1;
        /** gamma_en : R/W; bitpos: [9]; default: 0;
         *  this bit configures gamma enable. 0: disable, 1: enable
         */
        uint32_t gamma_en:1;
        /** rgb2yuv_en : R/W; bitpos: [10]; default: 1;
         *  this bit configures rgb2yuv enable. 0: disable, 1: enable
         */
        uint32_t rgb2yuv_en:1;
        /** sharp_en : R/W; bitpos: [11]; default: 0;
         *  this bit configures sharp enable. 0: disable, 1: enable
         */
        uint32_t sharp_en:1;
        /** color_en : R/W; bitpos: [12]; default: 0;
         *  this bit configures color enable. 0: disable, 1: enable
         */
        uint32_t color_en:1;
        /** yuv2rgb_en : R/W; bitpos: [13]; default: 1;
         *  this bit configures yuv2rgb enable. 0: disable, 1: enable
         */
        uint32_t yuv2rgb_en:1;
        /** ae_en : R/W; bitpos: [14]; default: 0;
         *  this bit configures ae enable. 0: disable, 1: enable
         */
        uint32_t ae_en:1;
        /** af_en : R/W; bitpos: [15]; default: 0;
         *  this bit configures af enable. 0: disable, 1: enable
         */
        uint32_t af_en:1;
        /** awb_en : R/W; bitpos: [16]; default: 0;
         *  this bit configures awb enable. 0: disable, 1: enable
         */
        uint32_t awb_en:1;
        /** hist_en : R/W; bitpos: [17]; default: 0;
         *  this bit configures hist enable. 0: disable, 1: enable
         */
        uint32_t hist_en:1;
        /** crop_en : R/W; bitpos: [18]; default: 0;
         *  this bit configures crop enable. 0: disable, 1: enable
         */
        uint32_t crop_en:1;
        /** wbg_en : R/W; bitpos: [19]; default: 0;
         *  this bit configures wbg enable. 0: disable, 1: enable
         */
        uint32_t wbg_en:1;
        uint32_t reserved_20:4;
        /** byte_endian_order : R/W; bitpos: [24]; default: 0;
         *  select input idi data byte_endian_order when isp is bypass, 0: csi_data[31:0], 1:
         *  {[7:0], [15:8], [23:16], [31:24]}
         */
        uint32_t byte_endian_order:1;
        /** isp_data_type : R/W; bitpos: [26:25]; default: 0;
         *  this field configures input data type, 0:RAW8 1:RAW10 2:RAW12
         */
        uint32_t isp_data_type:2;
        /** isp_in_src : R/W; bitpos: [28:27]; default: 0;
         *  this field configures input data source, 0:CSI HOST 1:CAM 2:DMA
         */
        uint32_t isp_in_src:2;
        /** isp_out_type : R/W; bitpos: [31:29]; default: 2;
         *  this field configures pixel output type, 0: RAW8 1: YUV422 2: RGB888 3: YUV420 4:
         *  RGB565
         */
        uint32_t isp_out_type:3;
    };
    uint32_t val;
} isp_cntl_reg_t;

/** Type of hsync_cnt register
 *  header hsync interval control register
 */
typedef union {
    struct {
        /** hsync_cnt : R/W; bitpos: [7:0]; default: 7;
         *  this field configures the number of clock before hsync and after vsync and line_end
         *  when decodes pix data from idi to isp
         */
        uint32_t hsync_cnt:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} isp_hsync_cnt_reg_t;

/** Type of frame_cfg register
 *  frame control parameter register
 */
typedef union {
    struct {
        /** vadr_num : R/W; bitpos: [11:0]; default: 480;
         *  this field configures input image size in y-direction, image row number - 1
         */
        uint32_t vadr_num:12;
        /** hadr_num : R/W; bitpos: [23:12]; default: 480;
         *  this field configures input image size in x-direction, image line number - 1
         */
        uint32_t hadr_num:12;
        uint32_t reserved_24:3;
        /** bayer_mode : R/W; bitpos: [28:27]; default: 0;
         *  this field configures the bayer mode of input pixel. 00 : BG/GR    01 : GB/RG   10
         *  : GR/BG  11 : RG/GB
         */
        uint32_t bayer_mode:2;
        /** hsync_start_exist : R/W; bitpos: [29]; default: 1;
         *  this bit configures the line end packet exist or not. 0: not exist, 1: exist
         */
        uint32_t hsync_start_exist:1;
        /** hsync_end_exist : R/W; bitpos: [30]; default: 1;
         *  this bit configures the line start packet exist or not. 0: not exist, 1: exist
         */
        uint32_t hsync_end_exist:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} isp_frame_cfg_reg_t;

/** Type of ccm_coef0 register
 *  ccm coef register 0
 */
typedef union {
    struct {
        /** ccm_rr : R/W; bitpos: [12:0]; default: 256;
         *  this field configures the color correction matrix coefficient
         */
        uint32_t ccm_rr:13;
        /** ccm_rg : R/W; bitpos: [25:13]; default: 0;
         *  this field configures the color correction matrix coefficient
         */
        uint32_t ccm_rg:13;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} isp_ccm_coef0_reg_t;

