espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of ccm_coef1 register
 *  ccm coef register 1
 */
typedef union {
    struct {
        /** ccm_rb : R/W; bitpos: [12:0]; default: 0;
         *  this field configures the color correction matrix coefficient
         */
        uint32_t ccm_rb:13;
        /** ccm_gr : R/W; bitpos: [25:13]; default: 0;
         *  this field configures the color correction matrix coefficient
         */
        uint32_t ccm_gr:13;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} isp_ccm_coef1_reg_t;

/** Type of ccm_coef3 register
 *  ccm coef register 3
 */
typedef union {
    struct {
        /** ccm_gg : R/W; bitpos: [12:0]; default: 256;
         *  this field configures the color correction matrix coefficient
         */
        uint32_t ccm_gg:13;
        /** ccm_gb : R/W; bitpos: [25:13]; default: 0;
         *  this field configures the color correction matrix coefficient
         */
        uint32_t ccm_gb:13;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} isp_ccm_coef3_reg_t;

/** Type of ccm_coef4 register
 *  ccm coef register 4
 */
typedef union {
    struct {
        /** ccm_br : R/W; bitpos: [12:0]; default: 0;
         *  this field configures the color correction matrix coefficient
         */
        uint32_t ccm_br:13;
        /** ccm_bg : R/W; bitpos: [25:13]; default: 0;
         *  this field configures the color correction matrix coefficient
         */
        uint32_t ccm_bg:13;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} isp_ccm_coef4_reg_t;

/** Type of ccm_coef5 register
 *  ccm coef register 5
 */
typedef union {
    struct {
        /** ccm_bb : R/W; bitpos: [12:0]; default: 256;
         *  this field configures the color correction matrix coefficient
         */
        uint32_t ccm_bb:13;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} isp_ccm_coef5_reg_t;

/** Type of bf_matrix_ctrl register
 *  bf pix2matrix ctrl
 */
typedef union {
    struct {
        /** bf_tail_pixen_pulse_tl : R/W; bitpos: [7:0]; default: 0;
         *  matrix tail pixen low level threshold, should not to large to prevent expanding to
         *  next frame, only reg_bf_tail_pixen_pulse_th!=0 and reg_bf_tail_pixen_pulse_tl!=0
         *  and reg_bf_tail_pixen_pulse_th < reg_bf_tail_pixen_pulse_tl will enable tail pulse
         *  function
         */
        uint32_t bf_tail_pixen_pulse_tl:8;
        /** bf_tail_pixen_pulse_th : R/W; bitpos: [15:8]; default: 0;
         *  matrix tail pixen high level threshold, must < hnum-1, only
         *  reg_bf_tail_pixen_pulse_th!=0 and reg_bf_tail_pixen_pulse_tl!=0 and
         *  reg_bf_tail_pixen_pulse_th < reg_bf_tail_pixen_pulse_tl will enable tail pulse
         *  function
         */
        uint32_t bf_tail_pixen_pulse_th:8;
        /** bf_padding_data : R/W; bitpos: [23:16]; default: 0;
         *  this field configures bf matrix padding data
         */
        uint32_t bf_padding_data:8;
        /** bf_padding_mode : R/W; bitpos: [24]; default: 0;
         *  this bit configures the padding mode of bf matrix.  0: use pixel in image to do
         *  padding   1: use reg_padding_data to do padding
         */
        uint32_t bf_padding_mode:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} isp_bf_matrix_ctrl_reg_t;

/** Type of bf_sigma register
 *  bf denoising level control register
 */
typedef union {
    struct {
        /** sigma : R/W; bitpos: [5:0]; default: 2;
         *  this field configures the bayer denoising level, valid data from 2 to 20
         */
        uint32_t sigma:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} isp_bf_sigma_reg_t;

/** Type of bf_gau0 register
 *  bf gau template register 0
 */
typedef union {
    struct {
        /** gau_template21 : R/W; bitpos: [3:0]; default: 15;
         *  this field configures index 21 of gaussian template
         */
        uint32_t gau_template21:4;
        /** gau_template20 : R/W; bitpos: [7:4]; default: 15;
         *  this field configures index 20 of gaussian template
         */
        uint32_t gau_template20:4;
        /** gau_template12 : R/W; bitpos: [11:8]; default: 15;
         *  this field configures index 12 of gaussian template
         */
        uint32_t gau_template12:4;
        /** gau_template11 : R/W; bitpos: [15:12]; default: 15;
         *  this field configures index 11 of gaussian template
         */
        uint32_t gau_template11:4;
        /** gau_template10 : R/W; bitpos: [19:16]; default: 15;
         *  this field configures index 10 of gaussian template
         */
        uint32_t gau_template10:4;
        /** gau_template02 : R/W; bitpos: [23:20]; default: 15;
         *  this field configures index 02 of gaussian template
         */
        uint32_t gau_template02:4;
        /** gau_template01 : R/W; bitpos: [27:24]; default: 15;
         *  this field configures index 01 of gaussian template
         */
        uint32_t gau_template01:4;
        /** gau_template00 : R/W; bitpos: [31:28]; default: 15;
         *  this field configures index 00 of gaussian template
         */
        uint32_t gau_template00:4;
    };
    uint32_t val;
} isp_bf_gau0_reg_t;

/** Type of bf_gau1 register
 *  bf gau template register 1
 */
typedef union {
    struct {
        /** gau_template22 : R/W; bitpos: [3:0]; default: 15;
         *  this field configures index 22 of gaussian template
         */
        uint32_t gau_template22:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} isp_bf_gau1_reg_t;

/** Type of dpc_ctrl register
 *  DPC mode control register
 */
typedef union {
    struct {
        /** dpc_check_en : R/W; bitpos: [0]; default: 0;
         *  this bit configures the check mode enable. 0: disable, 1: enable
         */
        uint32_t dpc_check_en:1;
        /** sta_en : R/W; bitpos: [1]; default: 0;
         *  this bit configures the sta dpc enable. 0: disable, 1: enable
         */
        uint32_t sta_en:1;
        /** dyn_en : R/W; bitpos: [2]; default: 1;
         *  this bit configures the dyn dpc enable. 0: disable, 1: enable
         */
        uint32_t dyn_en:1;
        /** dpc_black_en : R/W; bitpos: [3]; default: 0;
         *  this bit configures input image type select when in check mode, 0: white img, 1:
         *  black img
         */
        uint32_t dpc_black_en:1;
        /** dpc_method_sel : R/W; bitpos: [4]; default: 0;
         *  this bit configures dyn dpc method select. 0: simple method, 1: hard method
         */
        uint32_t dpc_method_sel:1;
        /** dpc_check_od_en : R/W; bitpos: [5]; default: 0;
         *  this bit configures output pixel data when in check mode or not. 0: no data output,
         *  1: data output
         */
        uint32_t dpc_check_od_en:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} isp_dpc_ctrl_reg_t;

