espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of gamma_ry3 register
 *  point of Y-axis of r channel gamma curve register 3
 */
typedef union {
    struct {
        /** gamma_r_y0b : R/W; bitpos: [7:0]; default: 192;
         *  this field configures the point 11 of Y-axis of r channel gamma curve
         */
        uint32_t gamma_r_y0b:8;
        /** gamma_r_y0a : R/W; bitpos: [15:8]; default: 176;
         *  this field configures the point 10 of Y-axis of r channel gamma curve
         */
        uint32_t gamma_r_y0a:8;
        /** gamma_r_y09 : R/W; bitpos: [23:16]; default: 160;
         *  this field configures the point 9 of Y-axis of r channel gamma curve
         */
        uint32_t gamma_r_y09:8;
        /** gamma_r_y08 : R/W; bitpos: [31:24]; default: 144;
         *  this field configures the point 8 of Y-axis of r channel gamma curve
         */
        uint32_t gamma_r_y08:8;
    };
    uint32_t val;
} isp_gamma_ry3_reg_t;

/** Type of gamma_ry4 register
 *  point of Y-axis of r channel gamma curve register 4
 */
typedef union {
    struct {
        /** gamma_r_y0f : R/W; bitpos: [7:0]; default: 255;
         *  this field configures the point 15 of Y-axis of r channel gamma curve
         */
        uint32_t gamma_r_y0f:8;
        /** gamma_r_y0e : R/W; bitpos: [15:8]; default: 240;
         *  this field configures the point 14 of Y-axis of r channel gamma curve
         */
        uint32_t gamma_r_y0e:8;
        /** gamma_r_y0d : R/W; bitpos: [23:16]; default: 224;
         *  this field configures the point 13 of Y-axis of r channel gamma curve
         */
        uint32_t gamma_r_y0d:8;
        /** gamma_r_y0c : R/W; bitpos: [31:24]; default: 208;
         *  this field configures the point 12 of Y-axis of r channel gamma curve
         */
        uint32_t gamma_r_y0c:8;
    };
    uint32_t val;
} isp_gamma_ry4_reg_t;

/** Type of gamma_gy1 register
 *  point of Y-axis of g channel gamma curve register 1
 */
typedef union {
    struct {
        /** gamma_g_y03 : R/W; bitpos: [7:0]; default: 64;
         *  this field configures the point 3 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y03:8;
        /** gamma_g_y02 : R/W; bitpos: [15:8]; default: 48;
         *  this field configures the point 2 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y02:8;
        /** gamma_g_y01 : R/W; bitpos: [23:16]; default: 32;
         *  this field configures the point 1 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y01:8;
        /** gamma_g_y00 : R/W; bitpos: [31:24]; default: 16;
         *  this field configures the point 0 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y00:8;
    };
    uint32_t val;
} isp_gamma_gy1_reg_t;

/** Type of gamma_gy2 register
 *  point of Y-axis of g channel gamma curve register 2
 */
typedef union {
    struct {
        /** gamma_g_y07 : R/W; bitpos: [7:0]; default: 128;
         *  this field configures the point 7 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y07:8;
        /** gamma_g_y06 : R/W; bitpos: [15:8]; default: 112;
         *  this field configures the point 6 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y06:8;
        /** gamma_g_y05 : R/W; bitpos: [23:16]; default: 96;
         *  this field configures the point 5 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y05:8;
        /** gamma_g_y04 : R/W; bitpos: [31:24]; default: 80;
         *  this field configures the point 4 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y04:8;
    };
    uint32_t val;
} isp_gamma_gy2_reg_t;

/** Type of gamma_gy3 register
 *  point of Y-axis of g channel gamma curve register 3
 */
typedef union {
    struct {
        /** gamma_g_y0b : R/W; bitpos: [7:0]; default: 192;
         *  this field configures the point 11 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y0b:8;
        /** gamma_g_y0a : R/W; bitpos: [15:8]; default: 176;
         *  this field configures the point 10 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y0a:8;
        /** gamma_g_y09 : R/W; bitpos: [23:16]; default: 160;
         *  this field configures the point 9 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y09:8;
        /** gamma_g_y08 : R/W; bitpos: [31:24]; default: 144;
         *  this field configures the point 8 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y08:8;
    };
    uint32_t val;
} isp_gamma_gy3_reg_t;

/** Type of gamma_gy4 register
 *  point of Y-axis of g channel gamma curve register 4
 */
typedef union {
    struct {
        /** gamma_g_y0f : R/W; bitpos: [7:0]; default: 255;
         *  this field configures the point 15 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y0f:8;
        /** gamma_g_y0e : R/W; bitpos: [15:8]; default: 240;
         *  this field configures the point 14 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y0e:8;
        /** gamma_g_y0d : R/W; bitpos: [23:16]; default: 224;
         *  this field configures the point 13 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y0d:8;
        /** gamma_g_y0c : R/W; bitpos: [31:24]; default: 208;
         *  this field configures the point 12 of Y-axis of g channel gamma curve
         */
        uint32_t gamma_g_y0c:8;
    };
    uint32_t val;
} isp_gamma_gy4_reg_t;

/** Type of gamma_by1 register
 *  point of Y-axis of b channel gamma curve register 1
 */
typedef union {
    struct {
        /** gamma_b_y03 : R/W; bitpos: [7:0]; default: 64;
         *  this field configures the point 3 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y03:8;
        /** gamma_b_y02 : R/W; bitpos: [15:8]; default: 48;
         *  this field configures the point 2 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y02:8;
        /** gamma_b_y01 : R/W; bitpos: [23:16]; default: 32;
         *  this field configures the point 1 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y01:8;
        /** gamma_b_y00 : R/W; bitpos: [31:24]; default: 16;
         *  this field configures the point 0 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y00:8;
    };
    uint32_t val;
} isp_gamma_by1_reg_t;

/** Type of gamma_by2 register
 *  point of Y-axis of b channel gamma curve register 2
 */
typedef union {
    struct {
        /** gamma_b_y07 : R/W; bitpos: [7:0]; default: 128;
         *  this field configures the point 7 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y07:8;
        /** gamma_b_y06 : R/W; bitpos: [15:8]; default: 112;
         *  this field configures the point 6 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y06:8;
        /** gamma_b_y05 : R/W; bitpos: [23:16]; default: 96;
         *  this field configures the point 5 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y05:8;
        /** gamma_b_y04 : R/W; bitpos: [31:24]; default: 80;
         *  this field configures the point 4 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y04:8;
    };
    uint32_t val;
} isp_gamma_by2_reg_t;

