espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of gamma_by3 register
 *  point of Y-axis of b channel gamma curve register 3
 */
typedef union {
    struct {
        /** gamma_b_y0b : R/W; bitpos: [7:0]; default: 192;
         *  this field configures the point 11 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y0b:8;
        /** gamma_b_y0a : R/W; bitpos: [15:8]; default: 176;
         *  this field configures the point 10 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y0a:8;
        /** gamma_b_y09 : R/W; bitpos: [23:16]; default: 160;
         *  this field configures the point 9 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y09:8;
        /** gamma_b_y08 : R/W; bitpos: [31:24]; default: 144;
         *  this field configures the point 8 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y08:8;
    };
    uint32_t val;
} isp_gamma_by3_reg_t;

/** Type of gamma_by4 register
 *  point of Y-axis of b channel gamma curve register 4
 */
typedef union {
    struct {
        /** gamma_b_y0f : R/W; bitpos: [7:0]; default: 255;
         *  this field configures the point 15 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y0f:8;
        /** gamma_b_y0e : R/W; bitpos: [15:8]; default: 240;
         *  this field configures the point 14 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y0e:8;
        /** gamma_b_y0d : R/W; bitpos: [23:16]; default: 224;
         *  this field configures the point 13 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y0d:8;
        /** gamma_b_y0c : R/W; bitpos: [31:24]; default: 208;
         *  this field configures the point 12 of Y-axis of b channel gamma curve
         */
        uint32_t gamma_b_y0c:8;
    };
    uint32_t val;
} isp_gamma_by4_reg_t;

/** Type of gamma_rx1 register
 *  point of X-axis of r channel gamma curve register 1
 */
typedef union {
    struct {
        /** gamma_r_x07 : R/W; bitpos: [2:0]; default: 4;
         *  this field configures the point 7 of X-axis of r channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_r_x07:3;
        /** gamma_r_x06 : R/W; bitpos: [5:3]; default: 4;
         *  this field configures the point 6 of X-axis of r channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_r_x06:3;
        /** gamma_r_x05 : R/W; bitpos: [8:6]; default: 4;
         *  this field configures the point 5 of X-axis of r channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_r_x05:3;
        /** gamma_r_x04 : R/W; bitpos: [11:9]; default: 4;
         *  this field configures the point 4 of X-axis of r channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_r_x04:3;
        /** gamma_r_x03 : R/W; bitpos: [14:12]; default: 4;
         *  this field configures the point 3 of X-axis of r channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_r_x03:3;
        /** gamma_r_x02 : R/W; bitpos: [17:15]; default: 4;
         *  this field configures the point 2 of X-axis of r channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_r_x02:3;
        /** gamma_r_x01 : R/W; bitpos: [20:18]; default: 4;
         *  this field configures the point 1 of X-axis of r channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_r_x01:3;
        /** gamma_r_x00 : R/W; bitpos: [23:21]; default: 4;
         *  this field configures the point 0 of X-axis of r channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_r_x00:3;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_gamma_rx1_reg_t;

/** Type of gamma_rx2 register
 *  point of X-axis of r channel gamma curve register 2
 */
typedef union {
    struct {
        /** gamma_r_x0f : R/W; bitpos: [2:0]; default: 4;
         *  this field configures the point 15 of X-axis of r channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_r_x0f:3;
        /** gamma_r_x0e : R/W; bitpos: [5:3]; default: 4;
         *  this field configures the point 14 of X-axis of r channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_r_x0e:3;
        /** gamma_r_x0d : R/W; bitpos: [8:6]; default: 4;
         *  this field configures the point 13 of X-axis of r channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_r_x0d:3;
        /** gamma_r_x0c : R/W; bitpos: [11:9]; default: 4;
         *  this field configures the point 12 of X-axis of r channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_r_x0c:3;
        /** gamma_r_x0b : R/W; bitpos: [14:12]; default: 4;
         *  this field configures the point 11 of X-axis of r channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_r_x0b:3;
        /** gamma_r_x0a : R/W; bitpos: [17:15]; default: 4;
         *  this field configures the point 10 of X-axis of r channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_r_x0a:3;
        /** gamma_r_x09 : R/W; bitpos: [20:18]; default: 4;
         *  this field configures the point 9 of X-axis of r channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_r_x09:3;
        /** gamma_r_x08 : R/W; bitpos: [23:21]; default: 4;
         *  this field configures the point 8 of X-axis of r channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_r_x08:3;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_gamma_rx2_reg_t;

/** Type of gamma_gx1 register
 *  point of X-axis of g channel gamma curve register 1
 */
typedef union {
    struct {
        /** gamma_g_x07 : R/W; bitpos: [2:0]; default: 4;
         *  this field configures the point 7 of X-axis of g channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_g_x07:3;
        /** gamma_g_x06 : R/W; bitpos: [5:3]; default: 4;
         *  this field configures the point 6 of X-axis of g channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_g_x06:3;
        /** gamma_g_x05 : R/W; bitpos: [8:6]; default: 4;
         *  this field configures the point 5 of X-axis of g channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_g_x05:3;
        /** gamma_g_x04 : R/W; bitpos: [11:9]; default: 4;
         *  this field configures the point 4 of X-axis of g channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_g_x04:3;
        /** gamma_g_x03 : R/W; bitpos: [14:12]; default: 4;
         *  this field configures the point 3 of X-axis of g channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_g_x03:3;
        /** gamma_g_x02 : R/W; bitpos: [17:15]; default: 4;
         *  this field configures the point 2 of X-axis of g channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_g_x02:3;
        /** gamma_g_x01 : R/W; bitpos: [20:18]; default: 4;
         *  this field configures the point 1 of X-axis of g channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_g_x01:3;
        /** gamma_g_x00 : R/W; bitpos: [23:21]; default: 4;
         *  this field configures the point 0 of X-axis of g channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_g_x00:3;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_gamma_gx1_reg_t;

/** Type of gamma_gx2 register
 *  point of X-axis of g channel gamma curve register 2
 */
typedef union {
    struct {
        /** gamma_g_x0f : R/W; bitpos: [2:0]; default: 4;
         *  this field configures the point 15 of X-axis of g channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_g_x0f:3;
        /** gamma_g_x0e : R/W; bitpos: [5:3]; default: 4;
         *  this field configures the point 14 of X-axis of g channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_g_x0e:3;
        /** gamma_g_x0d : R/W; bitpos: [8:6]; default: 4;
         *  this field configures the point 13 of X-axis of g channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_g_x0d:3;
        /** gamma_g_x0c : R/W; bitpos: [11:9]; default: 4;
         *  this field configures the point 12 of X-axis of g channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_g_x0c:3;
        /** gamma_g_x0b : R/W; bitpos: [14:12]; default: 4;
         *  this field configures the point 11 of X-axis of g channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_g_x0b:3;
        /** gamma_g_x0a : R/W; bitpos: [17:15]; default: 4;
         *  this field configures the point 10 of X-axis of g channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_g_x0a:3;
        /** gamma_g_x09 : R/W; bitpos: [20:18]; default: 4;
         *  this field configures the point 9 of X-axis of g channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_g_x09:3;
        /** gamma_g_x08 : R/W; bitpos: [23:21]; default: 4;
         *  this field configures the point 8 of X-axis of g channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_g_x08:3;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_gamma_gx2_reg_t;

/** Type of gamma_bx1 register
 *  point of X-axis of b channel gamma curve register 1
 */
typedef union {
    struct {
        /** gamma_b_x07 : R/W; bitpos: [2:0]; default: 4;
         *  this field configures the point 7 of X-axis of b channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_b_x07:3;
        /** gamma_b_x06 : R/W; bitpos: [5:3]; default: 4;
         *  this field configures the point 6 of X-axis of b channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_b_x06:3;
        /** gamma_b_x05 : R/W; bitpos: [8:6]; default: 4;
         *  this field configures the point 5 of X-axis of b channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_b_x05:3;
        /** gamma_b_x04 : R/W; bitpos: [11:9]; default: 4;
         *  this field configures the point 4 of X-axis of b channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_b_x04:3;
        /** gamma_b_x03 : R/W; bitpos: [14:12]; default: 4;
         *  this field configures the point 3 of X-axis of b channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_b_x03:3;
        /** gamma_b_x02 : R/W; bitpos: [17:15]; default: 4;
         *  this field configures the point 2 of X-axis of b channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_b_x02:3;
        /** gamma_b_x01 : R/W; bitpos: [20:18]; default: 4;
         *  this field configures the point 1 of X-axis of b channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_b_x01:3;
        /** gamma_b_x00 : R/W; bitpos: [23:21]; default: 4;
         *  this field configures the point 0 of X-axis of b channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_b_x00:3;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_gamma_bx1_reg_t;

/** Type of gamma_bx2 register
 *  point of X-axis of b channel gamma curve register 2
 */
typedef union {
    struct {
        /** gamma_b_x0f : R/W; bitpos: [2:0]; default: 4;
         *  this field configures the point 15 of X-axis of b channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_b_x0f:3;
        /** gamma_b_x0e : R/W; bitpos: [5:3]; default: 4;
         *  this field configures the point 14 of X-axis of b channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_b_x0e:3;
        /** gamma_b_x0d : R/W; bitpos: [8:6]; default: 4;
         *  this field configures the point 13 of X-axis of b channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_b_x0d:3;
        /** gamma_b_x0c : R/W; bitpos: [11:9]; default: 4;
         *  this field configures the point 12 of X-axis of b channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_b_x0c:3;
        /** gamma_b_x0b : R/W; bitpos: [14:12]; default: 4;
         *  this field configures the point 11 of X-axis of b channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_b_x0b:3;
        /** gamma_b_x0a : R/W; bitpos: [17:15]; default: 4;
         *  this field configures the point 10 of X-axis of b channel gamma curve, it
         *  represents the power of the distance from the previous point
         */
        uint32_t gamma_b_x0a:3;
        /** gamma_b_x09 : R/W; bitpos: [20:18]; default: 4;
         *  this field configures the point 9 of X-axis of b channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_b_x09:3;
        /** gamma_b_x08 : R/W; bitpos: [23:21]; default: 4;
         *  this field configures the point 8 of X-axis of b channel gamma curve, it represents
         *  the power of the distance from the previous point
         */
        uint32_t gamma_b_x08:3;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_gamma_bx2_reg_t;

