espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of ae_ctrl register
 *  ae control register
 */
typedef union {
    struct {
        /** ae_update : WT; bitpos: [0]; default: 0;
         *  write 1 to this bit triggers one statistic event
         */
        uint32_t ae_update:1;
        /** ae_select : R/W; bitpos: [1]; default: 0;
         *  this field configures ae input data source, 0: data from median, 1: data from gama
         */
        uint32_t ae_select:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} isp_ae_ctrl_reg_t;

/** Type of ae_monitor register
 *  ae monitor control register
 */
typedef union {
    struct {
        /** ae_monitor_tl : R/W; bitpos: [7:0]; default: 0;
         *  this field configures the lower lum threshold of ae monitor
         */
        uint32_t ae_monitor_tl:8;
        /** ae_monitor_th : R/W; bitpos: [15:8]; default: 0;
         *  this field configures the higher lum threshold of ae monitor
         */
        uint32_t ae_monitor_th:8;
        /** ae_monitor_period : R/W; bitpos: [21:16]; default: 0;
         *  this field configures ae monitor frame period
         */
        uint32_t ae_monitor_period:6;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} isp_ae_monitor_reg_t;

/** Type of ae_bx register
 *  ae window register in x-direction
 */
typedef union {
    struct {
        /** ae_x_bsize : R/W; bitpos: [10:0]; default: 384;
         *  this field configures every block x size
         */
        uint32_t ae_x_bsize:11;
        /** ae_x_start : R/W; bitpos: [21:11]; default: 0;
         *  this field configures first block start x address
         */
        uint32_t ae_x_start:11;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} isp_ae_bx_reg_t;

/** Type of ae_by register
 *  ae window register in y-direction
 */
typedef union {
    struct {
        /** ae_y_bsize : R/W; bitpos: [10:0]; default: 216;
         *  this field configures every block y size
         */
        uint32_t ae_y_bsize:11;
        /** ae_y_start : R/W; bitpos: [21:11]; default: 0;
         *  this field configures first block start y address
         */
        uint32_t ae_y_start:11;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} isp_ae_by_reg_t;

/** Type of ae_winpixnum register
 *  ae sub-window pix num register
 */
typedef union {
    struct {
        /** ae_subwin_pixnum : R/W; bitpos: [16:0]; default: 82944;
         *  this field configures the pixel number of each sub win
         */
        uint32_t ae_subwin_pixnum:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_ae_winpixnum_reg_t;

/** Type of ae_win_reciprocal register
 *  reciprocal of ae sub-window pixel number
 */
typedef union {
    struct {
        /** ae_subwin_recip : R/W; bitpos: [19:0]; default: 0;
         *  this field configures the reciprocal of each subwin_pixnum, 20bit fraction
         */
        uint32_t ae_subwin_recip:20;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} isp_ae_win_reciprocal_reg_t;

/** Type of sharp_ctrl0 register
 *  sharp control register 0
 */
typedef union {
    struct {
        /** sharp_threshold_low : R/W; bitpos: [7:0]; default: 0;
         *  this field configures sharpen threshold for detail
         */
        uint32_t sharp_threshold_low:8;
        /** sharp_threshold_high : R/W; bitpos: [15:8]; default: 0;
         *  this field configures sharpen threshold for edge
         */
        uint32_t sharp_threshold_high:8;
        /** sharp_amount_low : R/W; bitpos: [23:16]; default: 0;
         *  this field configures sharpen amount for detail
         */
        uint32_t sharp_amount_low:8;
        /** sharp_amount_high : R/W; bitpos: [31:24]; default: 0;
         *  this field configures sharpen amount for edge
         */
        uint32_t sharp_amount_high:8;
    };
    uint32_t val;
} isp_sharp_ctrl0_reg_t;

/** Type of sharp_filter0 register
 *  sharp usm config register 0
 */
typedef union {
    struct {
        /** sharp_filter_coe00 : R/W; bitpos: [4:0]; default: 1;
         *  this field configures unsharp masking(usm) filter coefficient
         */
        uint32_t sharp_filter_coe00:5;
        /** sharp_filter_coe01 : R/W; bitpos: [9:5]; default: 2;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe01:5;
        /** sharp_filter_coe02 : R/W; bitpos: [14:10]; default: 1;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe02:5;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} isp_sharp_filter0_reg_t;

/** Type of sharp_filter1 register
 *  sharp usm config register 1
 */
typedef union {
    struct {
        /** sharp_filter_coe10 : R/W; bitpos: [4:0]; default: 2;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe10:5;
        /** sharp_filter_coe11 : R/W; bitpos: [9:5]; default: 4;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe11:5;
        /** sharp_filter_coe12 : R/W; bitpos: [14:10]; default: 2;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe12:5;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} isp_sharp_filter1_reg_t;

/** Type of sharp_filter2 register
 *  sharp usm config register 2
 */
typedef union {
    struct {
        /** sharp_filter_coe20 : R/W; bitpos: [4:0]; default: 1;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe20:5;
        /** sharp_filter_coe21 : R/W; bitpos: [9:5]; default: 2;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe21:5;
        /** sharp_filter_coe22 : R/W; bitpos: [14:10]; default: 1;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe22:5;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} isp_sharp_filter2_reg_t;

/** Type of sharp_matrix_ctrl register
 *  sharp pix2matrix ctrl
 */
typedef union {
    struct {
        /** sharp_tail_pixen_pulse_tl : R/W; bitpos: [7:0]; default: 0;
         *  matrix tail pixen low level threshold,  should not to large to prevent expanding to
         *  next frame, only reg_demosaic_tail_pixen_pulse_th!=0 and
         *  reg_demosaic_tail_pixen_pulse_tl!=0 and reg_demosaic_tail_pixen_pulse_th <
         *  reg_demosaic_tail_pixen_pulse_tl will enable tail pulse function
         */
        uint32_t sharp_tail_pixen_pulse_tl:8;
        /** sharp_tail_pixen_pulse_th : R/W; bitpos: [15:8]; default: 0;
         *  matrix tail pixen high level threshold, must < hnum-1, only
         *  reg_sharp_tail_pixen_pulse_th!=0 and reg_sharp_tail_pixen_pulse_tl!=0 and
         *  reg_sharp_tail_pixen_pulse_th < reg_sharp_tail_pixen_pulse_tl will enable tail
         *  pulse function
         */
        uint32_t sharp_tail_pixen_pulse_th:8;
        /** sharp_padding_data : R/W; bitpos: [23:16]; default: 0;
         *  this field configures sharp padding data
         */
        uint32_t sharp_padding_data:8;
        /** sharp_padding_mode : R/W; bitpos: [24]; default: 0;
         *  this field configures sharp padding mode
         */
        uint32_t sharp_padding_mode:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} isp_sharp_matrix_ctrl_reg_t;

/** Type of sharp_ctrl1 register
 *  sharp control register 1
 */
typedef union {
    struct {
        /** sharp_gradient_max : RO; bitpos: [7:0]; default: 0;
         *  this field configures sharp max gradient, refresh at the end of each frame end
         */
        uint32_t sharp_gradient_max:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} isp_sharp_ctrl1_reg_t;

/** Type of dma_cntl register
 *  isp dma source trans control register
 */
typedef union {
    struct {
        /** dma_en : WT; bitpos: [0]; default: 0;
         *  write 1 to trigger dma to get 1 frame
         */
        uint32_t dma_en:1;
        /** dma_update_reg : R/W; bitpos: [1]; default: 0;
         *  write 1 to update reg_dma_burst_len & reg_dma_data_type
         */
        uint32_t dma_update_reg:1;
        /** dma_data_type : R/W; bitpos: [7:2]; default: 42;
         *  this field configures the idi data type for image data
         */
        uint32_t dma_data_type:6;
        /** dma_burst_len : R/W; bitpos: [19:8]; default: 128;
         *  this field configures dma burst len when data source is dma. set according to
         *  dma_msize, it is the number of 64bits in a dma transfer
         */
        uint32_t dma_burst_len:12;
        /** dma_interval : R/W; bitpos: [31:20]; default: 1;
         *  this field configures dma req interval, 12'b1: 1 cycle, 12'b11 2 cycle ...
         */
        uint32_t dma_interval:12;
    };
    uint32_t val;
} isp_dma_cntl_reg_t;

/** Type of dma_raw_data register
 *  isp dma source total raw number set register
 */
typedef union {
    struct {
        /** dma_raw_num_total : R/W; bitpos: [21:0]; default: 0;
         *  this field configures the the number of 64bits in a frame
         */
        uint32_t dma_raw_num_total:22;
        uint32_t reserved_22:9;
        /** dma_raw_num_total_set : WT; bitpos: [31]; default: 0;
         *  write 1 to update reg_dma_raw_num_total
         */
        uint32_t dma_raw_num_total_set:1;
    };
    uint32_t val;
} isp_dma_raw_data_reg_t;

