espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of cam_cntl register
 *  isp cam source control register
 */
typedef union {
    struct {
        /** cam_en : R/W; bitpos: [0]; default: 0;
         *  write 1 to start receive camera data, write 0 to disable
         */
        uint32_t cam_en:1;
        /** cam_update_reg : R/W; bitpos: [1]; default: 0;
         *  write 1 to update ISP_CAM_CONF
         */
        uint32_t cam_update_reg:1;
        /** cam_reset : R/W; bitpos: [2]; default: 1;
         *  this bit configures cam clk domain reset, 1: reset cam input logic, 0: release reset
         */
        uint32_t cam_reset:1;
        /** cam_clk_inv : R/W; bitpos: [3]; default: 0;
         *  this bit configures the inversion of cam clk from pad. 0: not invert cam clk, 1:
         *  invert cam clk
         */
        uint32_t cam_clk_inv:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} isp_cam_cntl_reg_t;

/** Type of cam_conf register
 *  isp cam source config register
 */
typedef union {
    struct {
        /** cam_data_order : R/W; bitpos: [0]; default: 0;
         *  this field configures data order of cam port, 0: cam_data_in, 1:{cam_data_in[7:0],
         *  cam_data_in[15:8]}
         */
        uint32_t cam_data_order:1;
        /** cam_2byte_mode : R/W; bitpos: [1]; default: 0;
         *  this field configures enable of cam 2 byte mode(input 2 bytes each clock). 0:
         *  disable, 1: enable
         */
        uint32_t cam_2byte_mode:1;
        /** cam_data_type : R/W; bitpos: [7:2]; default: 42;
         *  this field configures idi data type for image data, 0x2a: RAW8, 0x2b: RAW10, 0x2c:
         *  RAW12
         */
        uint32_t cam_data_type:6;
        /** cam_de_inv : R/W; bitpos: [8]; default: 0;
         *  this bit configures cam data enable invert. 0: not invert, 1: invert
         */
        uint32_t cam_de_inv:1;
        /** cam_hsync_inv : R/W; bitpos: [9]; default: 0;
         *  this bit configures cam hsync invert. 0: not invert, 1: invert
         */
        uint32_t cam_hsync_inv:1;
        /** cam_vsync_inv : R/W; bitpos: [10]; default: 0;
         *  this bit configures cam vsync invert. 0: not invert, 1: invert
         */
        uint32_t cam_vsync_inv:1;
        /** cam_vsync_filter_thres : R/W; bitpos: [13:11]; default: 0;
         *  this bit configures the number of clock of vsync filter length
         */
        uint32_t cam_vsync_filter_thres:3;
        /** cam_vsync_filter_en : R/W; bitpos: [14]; default: 0;
         *  this bit configures vsync filter en
         */
        uint32_t cam_vsync_filter_en:1;
        /** cam_de_only : R/W; bitpos: [15]; default: 0;
         *  configures whether cam inf only has de, no hsync data. 0: has hsync, 1: no hsync
         */
        uint32_t cam_de_only:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} isp_cam_conf_reg_t;

/** Type of af_ctrl0 register
 *  af control register 0
 */
typedef union {
    struct {
        /** af_auto_update : R/W; bitpos: [0]; default: 0;
         *  this bit configures auto_update enable. when set to 1, will update sum and lum each
         *  frame
         */
        uint32_t af_auto_update:1;
        uint32_t reserved_1:3;
        /** af_manual_update : WT; bitpos: [4]; default: 0;
         *  write 1 to this bit will update the sum and lum once
         */
        uint32_t af_manual_update:1;
        uint32_t reserved_5:3;
        /** af_env_threshold : R/W; bitpos: [11:8]; default: 0;
         *  this field configures env threshold. when both sum and lum changes larger than this
         *  value, consider environment changes and need to trigger a new autofocus. 4Bit
         *  fractional
         */
        uint32_t af_env_threshold:4;
        uint32_t reserved_12:4;
        /** af_env_period : R/W; bitpos: [23:16]; default: 0;
         *  this field configures environment changes detection period (frame). When set to 0,
         *  disable this function
         */
        uint32_t af_env_period:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_af_ctrl0_reg_t;

/** Type of af_ctrl1 register
 *  af control register 1
 */
typedef union {
    struct {
        /** af_thpixnum : R/W; bitpos: [21:0]; default: 0;
         *  this field configures pixnum used when calculating the autofocus threshold. Set to
         *  0 to disable threshold calculation
         */
        uint32_t af_thpixnum:22;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} isp_af_ctrl1_reg_t;

/** Type of af_gen_th_ctrl register
 *  af gen threshold control register
 */
typedef union {
    struct {
        /** af_gen_threshold_min : R/W; bitpos: [15:0]; default: 128;
         *  this field configures min threshold when use auto_threshold
         */
        uint32_t af_gen_threshold_min:16;
        /** af_gen_threshold_max : R/W; bitpos: [31:16]; default: 1088;
         *  this field configures max threshold when use auto_threshold
         */
        uint32_t af_gen_threshold_max:16;
    };
    uint32_t val;
} isp_af_gen_th_ctrl_reg_t;

/** Type of af_env_user_th_sum register
 *  af monitor user sum threshold register
 */
typedef union {
    struct {
        /** af_env_user_threshold_sum : R/W; bitpos: [31:0]; default: 0;
         *  this field configures user setup env detect sum threshold
         */
        uint32_t af_env_user_threshold_sum:32;
    };
    uint32_t val;
} isp_af_env_user_th_sum_reg_t;

/** Type of af_env_user_th_lum register
 *  af monitor user lum threshold register
 */
typedef union {
    struct {
        /** af_env_user_threshold_lum : R/W; bitpos: [29:0]; default: 0;
         *  this field configures user setup env detect lum threshold
         */
        uint32_t af_env_user_threshold_lum:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_af_env_user_th_lum_reg_t;

/** Type of af_threshold register
 *  af threshold register
 */
typedef union {
    struct {
        /** af_threshold : R/W; bitpos: [15:0]; default: 256;
         *  this field configures user threshold. When set to non-zero, autofocus will use this
         *  threshold
         */
        uint32_t af_threshold:16;
        /** af_gen_threshold : RO; bitpos: [31:16]; default: 0;
         *  this field represents the last calculated threshold
         */
        uint32_t af_gen_threshold:16;
    };
    uint32_t val;
} isp_af_threshold_reg_t;

/** Type of af_hscale_a register
 *  h-scale of af window a register
 */
typedef union {
    struct {
        /** af_rpoint_a : R/W; bitpos: [11:0]; default: 128;
         *  this field configures left coordinate of focus window a, must >= 2
         */
        uint32_t af_rpoint_a:12;
        uint32_t reserved_12:4;
        /** af_lpoint_a : R/W; bitpos: [27:16]; default: 1;
         *  this field configures top coordinate of focus window a, must >= 2
         */
        uint32_t af_lpoint_a:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_hscale_a_reg_t;

