espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of af_vscale_a register
 *  v-scale of af window a register
 */
typedef union {
    struct {
        /** af_bpoint_a : R/W; bitpos: [11:0]; default: 128;
         *  this field configures right coordinate of focus window a, must <= hnum-2
         */
        uint32_t af_bpoint_a:12;
        uint32_t reserved_12:4;
        /** af_tpoint_a : R/W; bitpos: [27:16]; default: 1;
         *  this field configures bottom coordinate of focus window a, must <= hnum-2
         */
        uint32_t af_tpoint_a:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_vscale_a_reg_t;

/** Type of af_hscale_b register
 *  h-scale of af window b register
 */
typedef union {
    struct {
        /** af_rpoint_b : R/W; bitpos: [11:0]; default: 128;
         *  this field configures left coordinate of focus window b, must >= 2
         */
        uint32_t af_rpoint_b:12;
        uint32_t reserved_12:4;
        /** af_lpoint_b : R/W; bitpos: [27:16]; default: 1;
         *  this field configures top coordinate of focus window b, must >= 2
         */
        uint32_t af_lpoint_b:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_hscale_b_reg_t;

/** Type of af_vscale_b register
 *  v-scale of af window b register
 */
typedef union {
    struct {
        /** af_bpoint_b : R/W; bitpos: [11:0]; default: 128;
         *  this field configures right coordinate of focus window b, must <= hnum-2
         */
        uint32_t af_bpoint_b:12;
        uint32_t reserved_12:4;
        /** af_tpoint_b : R/W; bitpos: [27:16]; default: 1;
         *  this field configures bottom coordinate of focus window b, must <= hnum-2
         */
        uint32_t af_tpoint_b:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_vscale_b_reg_t;

/** Type of af_hscale_c register
 *  v-scale of af window c register
 */
typedef union {
    struct {
        /** af_rpoint_c : R/W; bitpos: [11:0]; default: 128;
         *  this field configures left coordinate of focus window c, must >= 2
         */
        uint32_t af_rpoint_c:12;
        uint32_t reserved_12:4;
        /** af_lpoint_c : R/W; bitpos: [27:16]; default: 1;
         *  this field configures top coordinate of focus window c, must >= 2
         */
        uint32_t af_lpoint_c:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_hscale_c_reg_t;

/** Type of af_vscale_c register
 *  v-scale of af window c register
 */
typedef union {
    struct {
        /** af_bpoint_c : R/W; bitpos: [11:0]; default: 128;
         *  this field configures right coordinate of focus window c, must <= hnum-2
         */
        uint32_t af_bpoint_c:12;
        uint32_t reserved_12:4;
        /** af_tpoint_c : R/W; bitpos: [27:16]; default: 1;
         *  this field configures bottom coordinate of focus window c, must <= hnum-2
         */
        uint32_t af_tpoint_c:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_vscale_c_reg_t;

/** Type of awb_mode register
 *  awb mode control register
 */
typedef union {
    struct {
        /** awb_mode : R/W; bitpos: [1:0]; default: 3;
         *  this field configures awb algo sel. 00: none selected. 01: sel algo0. 10: sel
         *  algo1. 11: sel both algo0 and algo1
         */
        uint32_t awb_mode:2;
        uint32_t reserved_2:2;
        /** awb_sample : R/W; bitpos: [4]; default: 0;
         *  this bit configures awb sample location, 0:before ccm, 1:after ccm
         */
        uint32_t awb_sample:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} isp_awb_mode_reg_t;

/** Type of awb_hscale register
 *  h-scale of awb window
 */
typedef union {
    struct {
        /** awb_rpoint : R/W; bitpos: [11:0]; default: 1919;
         *  this field configures awb window right coordinate
         */
        uint32_t awb_rpoint:12;
        uint32_t reserved_12:4;
        /** awb_lpoint : R/W; bitpos: [27:16]; default: 0;
         *  this field configures awb window left coordinate
         */
        uint32_t awb_lpoint:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_awb_hscale_reg_t;

/** Type of awb_vscale register
 *  v-scale of awb window
 */
typedef union {
    struct {
        /** awb_bpoint : R/W; bitpos: [11:0]; default: 1079;
         *  this field configures awb window bottom coordinate
         */
        uint32_t awb_bpoint:12;
        uint32_t reserved_12:4;
        /** awb_tpoint : R/W; bitpos: [27:16]; default: 0;
         *  this field configures awb window top coordinate
         */
        uint32_t awb_tpoint:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_awb_vscale_reg_t;

/** Type of awb_th_lum register
 *  awb lum threshold register
 */
typedef union {
    struct {
        /** awb_min_lum : R/W; bitpos: [9:0]; default: 0;
         *  this field configures lower threshold of r+g+b
         */
        uint32_t awb_min_lum:10;
        uint32_t reserved_10:6;
        /** awb_max_lum : R/W; bitpos: [25:16]; default: 765;
         *  this field configures upper threshold of r+g+b
         */
        uint32_t awb_max_lum:10;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} isp_awb_th_lum_reg_t;

/** Type of awb_th_rg register
 *  awb r/g threshold register
 */
typedef union {
    struct {
        /** awb_min_rg : R/W; bitpos: [9:0]; default: 0;
         *  this field configures lower threshold of r/g, 2bit integer and 8bit fraction
         */
        uint32_t awb_min_rg:10;
        uint32_t reserved_10:6;
        /** awb_max_rg : R/W; bitpos: [25:16]; default: 1023;
         *  this field configures upper threshold of r/g, 2bit integer and 8bit fraction
         */
        uint32_t awb_max_rg:10;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} isp_awb_th_rg_reg_t;

/** Type of awb_th_bg register
 *  awb b/g threshold register
 */
typedef union {
    struct {
        /** awb_min_bg : R/W; bitpos: [9:0]; default: 0;
         *  this field configures lower threshold of b/g, 2bit integer and 8bit fraction
         */
        uint32_t awb_min_bg:10;
        uint32_t reserved_10:6;
        /** awb_max_bg : R/W; bitpos: [25:16]; default: 1023;
         *  this field configures upper threshold of b/g, 2bit integer and 8bit fraction
         */
        uint32_t awb_max_bg:10;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} isp_awb_th_bg_reg_t;

/** Type of color_ctrl register
 *  color control register
 */
typedef union {
    struct {
        /** color_saturation : R/W; bitpos: [7:0]; default: 128;
         *  this field configures the color saturation value
         */
        uint32_t color_saturation:8;
        /** color_hue : R/W; bitpos: [15:8]; default: 0;
         *  this field configures the color hue angle
         */
        uint32_t color_hue:8;
        /** color_contrast : R/W; bitpos: [23:16]; default: 128;
         *  this field configures the color contrast value
         */
        uint32_t color_contrast:8;
        /** color_brightness : R/W; bitpos: [31:24]; default: 0;
         *  this field configures the color brightness value, signed 2's complement
         */
        uint32_t color_brightness:8;
    };
    uint32_t val;
} isp_color_ctrl_reg_t;

/** Type of blc_value register
 *  blc black level register
 */
typedef union {
    struct {
        /** blc_r3_value : R/W; bitpos: [7:0]; default: 0;
         *  this field configures the black level of bottom right channel of bayer img
         */
        uint32_t blc_r3_value:8;
        /** blc_r2_value : R/W; bitpos: [15:8]; default: 0;
         *  this field configures the black level of bottom left channel of bayer img
         */
        uint32_t blc_r2_value:8;
        /** blc_r1_value : R/W; bitpos: [23:16]; default: 0;
         *  this field configures the black level of top right channel of bayer img
         */
        uint32_t blc_r1_value:8;
        /** blc_r0_value : R/W; bitpos: [31:24]; default: 0;
         *  this field configures the black level of top left channel of bayer img
         */
        uint32_t blc_r0_value:8;
    };
    uint32_t val;
} isp_blc_value_reg_t;

/** Type of blc_ctrl0 register
 *  blc stretch control register
 */
typedef union {
    struct {
        /** blc_r3_stretch : R/W; bitpos: [0]; default: 0;
         *  this bit configures the stretch feature of bottom right channel. 0: stretch
         *  disable, 1: stretch enable
         */
        uint32_t blc_r3_stretch:1;
        /** blc_r2_stretch : R/W; bitpos: [1]; default: 0;
         *  this bit configures the stretch feature of bottom left channel. 0: stretch disable,
         *  1: stretch enable
         */
        uint32_t blc_r2_stretch:1;
        /** blc_r1_stretch : R/W; bitpos: [2]; default: 0;
         *  this bit configures the stretch feature of top right channel. 0: stretch disable,
         *  1: stretch enable
         */
        uint32_t blc_r1_stretch:1;
        /** blc_r0_stretch : R/W; bitpos: [3]; default: 0;
         *  this bit configures the stretch feature of top left channel. 0: stretch disable, 1:
         *  stretch enable
         */
        uint32_t blc_r0_stretch:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} isp_blc_ctrl0_reg_t;

/** Type of blc_ctrl1 register
 *  blc window control register
 */
typedef union {
    struct {
        /** blc_window_top : R/W; bitpos: [10:0]; default: 0;
         *  this field configures blc average calculation window top
         */
        uint32_t blc_window_top:11;
        /** blc_window_left : R/W; bitpos: [21:11]; default: 0;
         *  this field configures blc average calculation window left
         */
        uint32_t blc_window_left:11;
        /** blc_window_vnum : R/W; bitpos: [25:22]; default: 0;
         *  this field configures blc average calculation window vnum
         */
        uint32_t blc_window_vnum:4;
        /** blc_window_hnum : R/W; bitpos: [29:26]; default: 0;
         *  this field configures blc average calculation window hnum
         */
        uint32_t blc_window_hnum:4;
        /** blc_filter_en : R/W; bitpos: [30]; default: 0;
         *  this bit configures enable blc average input filter. 0: disable, 1: enable
         */
        uint32_t blc_filter_en:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} isp_blc_ctrl1_reg_t;

/** Type of blc_ctrl2 register
 *  blc black threshold control register
 */
typedef union {
    struct {
        /** blc_r3_th : R/W; bitpos: [7:0]; default: 0;
         *  this field configures black threshold when get blc average of bottom right channel
         */
        uint32_t blc_r3_th:8;
        /** blc_r2_th : R/W; bitpos: [15:8]; default: 0;
         *  this field configures black threshold when get blc average of bottom left channel
         */
        uint32_t blc_r2_th:8;
        /** blc_r1_th : R/W; bitpos: [23:16]; default: 0;
         *  this field configures black threshold when get blc average of top right channel
         */
        uint32_t blc_r1_th:8;
        /** blc_r0_th : R/W; bitpos: [31:24]; default: 0;
         *  this field configures black threshold when get blc average of top left channel
         */
        uint32_t blc_r0_th:8;
    };
    uint32_t val;
} isp_blc_ctrl2_reg_t;

/** Type of hist_mode register
 *  histogram mode control register
 */
typedef union {
    struct {
        /** hist_mode : R/W; bitpos: [2:0]; default: 4;
         *  this field configures statistic mode. 0: RAW_B, 1: RAW_GB, 2: RAW_GR 3: RAW_R, 4:
         *  RGB, 5:YUV_Y, 6:YUV_U, 7:YUV_V
         */
        uint32_t hist_mode:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} isp_hist_mode_reg_t;

/** Type of hist_coeff register
 *  histogram rgb to gray coefficients register
 */
typedef union {
    struct {
        /** hist_coeff_b : R/W; bitpos: [7:0]; default: 85;
         *  this field configures coefficient of B when set hist_mode to RGB, sum of coeff_r
         *  and coeff_g and coeff_b should be 256
         */
        uint32_t hist_coeff_b:8;
        /** hist_coeff_g : R/W; bitpos: [15:8]; default: 85;
         *  this field configures coefficient of G when set hist_mode to RGB, sum of coeff_r
         *  and coeff_g and coeff_b should be 256
         */
        uint32_t hist_coeff_g:8;
        /** hist_coeff_r : R/W; bitpos: [23:16]; default: 85;
         *  this field configures coefficient of R when set hist_mode to RGB, sum of coeff_r
         *  and coeff_g and coeff_b should be 256
         */
        uint32_t hist_coeff_r:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_hist_coeff_reg_t;

/** Type of hist_offs register
 *  histogram window offsets register
 */
typedef union {
    struct {
        /** hist_y_offs : R/W; bitpos: [11:0]; default: 0;
         *  this field configures y coordinate of first window
         */
        uint32_t hist_y_offs:12;
        uint32_t reserved_12:4;
        /** hist_x_offs : R/W; bitpos: [27:16]; default: 0;
         *  this field configures x coordinate of first window
         */
        uint32_t hist_x_offs:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_hist_offs_reg_t;

/** Type of hist_size register
 *  histogram sub-window size register
 */
typedef union {
    struct {
        /** hist_y_size : R/W; bitpos: [8:0]; default: 32;
         *  this field configures y direction size of subwindow
         */
        uint32_t hist_y_size:9;
        uint32_t reserved_9:7;
        /** hist_x_size : R/W; bitpos: [24:16]; default: 18;
         *  this field configures x direction size of subwindow
         */
        uint32_t hist_x_size:9;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} isp_hist_size_reg_t;

