espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of hist_seg0 register
 *  histogram bin control register 0
 */
typedef union {
    struct {
        /** hist_seg_3_4 : R/W; bitpos: [7:0]; default: 64;
         *  this field configures threshold of histogram bin 3 and bin 4
         */
        uint32_t hist_seg_3_4:8;
        /** hist_seg_2_3 : R/W; bitpos: [15:8]; default: 48;
         *  this field configures threshold of histogram bin 2 and bin 3
         */
        uint32_t hist_seg_2_3:8;
        /** hist_seg_1_2 : R/W; bitpos: [23:16]; default: 32;
         *  this field configures threshold of histogram bin 1 and bin 2
         */
        uint32_t hist_seg_1_2:8;
        /** hist_seg_0_1 : R/W; bitpos: [31:24]; default: 16;
         *  this field configures threshold of histogram bin 0 and bin 1
         */
        uint32_t hist_seg_0_1:8;
    };
    uint32_t val;
} isp_hist_seg0_reg_t;

/** Type of hist_seg1 register
 *  histogram bin control register 1
 */
typedef union {
    struct {
        /** hist_seg_7_8 : R/W; bitpos: [7:0]; default: 128;
         *  this field configures threshold of histogram bin 7 and bin 8
         */
        uint32_t hist_seg_7_8:8;
        /** hist_seg_6_7 : R/W; bitpos: [15:8]; default: 112;
         *  this field configures threshold of histogram bin 6 and bin 7
         */
        uint32_t hist_seg_6_7:8;
        /** hist_seg_5_6 : R/W; bitpos: [23:16]; default: 96;
         *  this field configures threshold of histogram bin 5 and bin 6
         */
        uint32_t hist_seg_5_6:8;
        /** hist_seg_4_5 : R/W; bitpos: [31:24]; default: 80;
         *  this field configures threshold of histogram bin 4 and bin 5
         */
        uint32_t hist_seg_4_5:8;
    };
    uint32_t val;
} isp_hist_seg1_reg_t;

/** Type of hist_seg2 register
 *  histogram bin control register 2
 */
typedef union {
    struct {
        /** hist_seg_11_12 : R/W; bitpos: [7:0]; default: 192;
         *  this field configures threshold of histogram bin 11 and bin 12
         */
        uint32_t hist_seg_11_12:8;
        /** hist_seg_10_11 : R/W; bitpos: [15:8]; default: 176;
         *  this field configures threshold of histogram bin 10 and bin 11
         */
        uint32_t hist_seg_10_11:8;
        /** hist_seg_9_10 : R/W; bitpos: [23:16]; default: 160;
         *  this field configures threshold of histogram bin 9 and bin 10
         */
        uint32_t hist_seg_9_10:8;
        /** hist_seg_8_9 : R/W; bitpos: [31:24]; default: 144;
         *  this field configures threshold of histogram bin 8 and bin 9
         */
        uint32_t hist_seg_8_9:8;
    };
    uint32_t val;
} isp_hist_seg2_reg_t;

/** Type of hist_seg3 register
 *  histogram bin control register 3
 */
typedef union {
    struct {
        /** hist_seg_14_15 : R/W; bitpos: [7:0]; default: 240;
         *  this field configures threshold of histogram bin 14 and bin 15
         */
        uint32_t hist_seg_14_15:8;
        /** hist_seg_13_14 : R/W; bitpos: [15:8]; default: 224;
         *  this field configures threshold of histogram bin 13 and bin 14
         */
        uint32_t hist_seg_13_14:8;
        /** hist_seg_12_13 : R/W; bitpos: [23:16]; default: 208;
         *  this field configures threshold of histogram bin 12 and bin 13
         */
        uint32_t hist_seg_12_13:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_hist_seg3_reg_t;

/** Type of hist_weight0 register
 *  histogram sub-window weight register 0
 */
typedef union {
    struct {
        /** hist_weight_03 : R/W; bitpos: [7:0]; default: 1;
         *  this field configures weight of subwindow 03
         */
        uint32_t hist_weight_03:8;
        /** hist_weight_02 : R/W; bitpos: [15:8]; default: 1;
         *  this field configures weight of subwindow 02
         */
        uint32_t hist_weight_02:8;
        /** hist_weight_01 : R/W; bitpos: [23:16]; default: 1;
         *  this field configures weight of subwindow 01
         */
        uint32_t hist_weight_01:8;
        /** hist_weight_00 : R/W; bitpos: [31:24]; default: 1;
         *  this field configures weight of subwindow 00 and sum of all weight should be 256
         */
        uint32_t hist_weight_00:8;
    };
    uint32_t val;
} isp_hist_weight0_reg_t;

/** Type of hist_weight1 register
 *  histogram sub-window weight register 1
 */
typedef union {
    struct {
        /** hist_weight_12 : R/W; bitpos: [7:0]; default: 1;
         *  this field configures weight of subwindow 12
         */
        uint32_t hist_weight_12:8;
        /** hist_weight_11 : R/W; bitpos: [15:8]; default: 1;
         *  this field configures weight of subwindow 11
         */
        uint32_t hist_weight_11:8;
        /** hist_weight_10 : R/W; bitpos: [23:16]; default: 1;
         *  this field configures weight of subwindow 10
         */
        uint32_t hist_weight_10:8;
        /** hist_weight_04 : R/W; bitpos: [31:24]; default: 1;
         *  this field configures weight of subwindow 04
         */
        uint32_t hist_weight_04:8;
    };
    uint32_t val;
} isp_hist_weight1_reg_t;

/** Type of hist_weight2 register
 *  histogram sub-window weight register 2
 */
typedef union {
    struct {
        /** hist_weight_21 : R/W; bitpos: [7:0]; default: 1;
         *  this field configures weight of subwindow 21
         */
        uint32_t hist_weight_21:8;
        /** hist_weight_20 : R/W; bitpos: [15:8]; default: 1;
         *  this field configures weight of subwindow 20
         */
        uint32_t hist_weight_20:8;
        /** hist_weight_14 : R/W; bitpos: [23:16]; default: 1;
         *  this field configures weight of subwindow 04
         */
        uint32_t hist_weight_14:8;
        /** hist_weight_13 : R/W; bitpos: [31:24]; default: 1;
         *  this field configures weight of subwindow 13
         */
        uint32_t hist_weight_13:8;
    };
    uint32_t val;
} isp_hist_weight2_reg_t;

/** Type of hist_weight3 register
 *  histogram sub-window weight register 3
 */
typedef union {
    struct {
        /** hist_weight_30 : R/W; bitpos: [7:0]; default: 1;
         *  this field configures weight of subwindow 30
         */
        uint32_t hist_weight_30:8;
        /** hist_weight_24 : R/W; bitpos: [15:8]; default: 1;
         *  this field configures weight of subwindow 24
         */
        uint32_t hist_weight_24:8;
        /** hist_weight_23 : R/W; bitpos: [23:16]; default: 1;
         *  this field configures weight of subwindow 23
         */
        uint32_t hist_weight_23:8;
        /** hist_weight_22 : R/W; bitpos: [31:24]; default: 232;
         *  this field configures weight of subwindow 22
         */
        uint32_t hist_weight_22:8;
    };
    uint32_t val;
} isp_hist_weight3_reg_t;

/** Type of hist_weight4 register
 *  histogram sub-window weight register 4
 */
typedef union {
    struct {
        /** hist_weight_34 : R/W; bitpos: [7:0]; default: 1;
         *  this field configures weight of subwindow 34
         */
        uint32_t hist_weight_34:8;
        /** hist_weight_33 : R/W; bitpos: [15:8]; default: 1;
         *  this field configures weight of subwindow 33
         */
        uint32_t hist_weight_33:8;
        /** hist_weight_32 : R/W; bitpos: [23:16]; default: 1;
         *  this field configures weight of subwindow 32
         */
        uint32_t hist_weight_32:8;
        /** hist_weight_31 : R/W; bitpos: [31:24]; default: 1;
         *  this field configures weight of subwindow 31
         */
        uint32_t hist_weight_31:8;
    };
    uint32_t val;
} isp_hist_weight4_reg_t;

/** Type of hist_weight5 register
 *  histogram sub-window weight register 5
 */
typedef union {
    struct {
        /** hist_weight_43 : R/W; bitpos: [7:0]; default: 1;
         *  this field configures weight of subwindow 43
         */
        uint32_t hist_weight_43:8;
        /** hist_weight_42 : R/W; bitpos: [15:8]; default: 1;
         *  this field configures weight of subwindow 42
         */
        uint32_t hist_weight_42:8;
        /** hist_weight_41 : R/W; bitpos: [23:16]; default: 1;
         *  this field configures weight of subwindow 41
         */
        uint32_t hist_weight_41:8;
        /** hist_weight_40 : R/W; bitpos: [31:24]; default: 1;
         *  this field configures weight of subwindow 40
         */
        uint32_t hist_weight_40:8;
    };
    uint32_t val;
} isp_hist_weight5_reg_t;

/** Type of hist_weight6 register
 *  histogram sub-window weight register 6
 */
typedef union {
    struct {
        /** hist_weight_44 : R/W; bitpos: [7:0]; default: 1;
         *  this field configures weight of subwindow 44
         */
        uint32_t hist_weight_44:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} isp_hist_weight6_reg_t;

