espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of mem_aux_ctrl_0 register
 *  mem aux control register 0
 */
typedef union {
    struct {
        /** header_mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  this field configures the mem_aux of isp input buffer memory
         */
        uint32_t header_mem_aux_ctrl:14;
        uint32_t reserved_14:2;
        /** dpc_lut_mem_aux_ctrl : R/W; bitpos: [29:16]; default: 4896;
         *  this field represents this field configures the mem_aux of dpc lut memory
         */
        uint32_t dpc_lut_mem_aux_ctrl:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_mem_aux_ctrl_0_reg_t;

/** Type of mem_aux_ctrl_1 register
 *  mem aux control register 1
 */
typedef union {
    struct {
        /** lsc_lut_r_gr_mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  this field configures the mem_aux of lsc r gr lut memory
         */
        uint32_t lsc_lut_r_gr_mem_aux_ctrl:14;
        uint32_t reserved_14:2;
        /** lsc_lut_gb_b_mem_aux_ctrl : R/W; bitpos: [29:16]; default: 4896;
         *  this field configures the mem_aux of lsc gb b lut memory
         */
        uint32_t lsc_lut_gb_b_mem_aux_ctrl:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_mem_aux_ctrl_1_reg_t;

/** Type of mem_aux_ctrl_2 register
 *  mem aux control register 2
 */
typedef union {
    struct {
        /** bf_matrix_mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  this field configures the mem_aux of bf line buffer memory
         */
        uint32_t bf_matrix_mem_aux_ctrl:14;
        uint32_t reserved_14:2;
        /** dpc_matrix_mem_aux_ctrl : R/W; bitpos: [29:16]; default: 4896;
         *  this field configures the mem_aux of dpc line buffer memory
         */
        uint32_t dpc_matrix_mem_aux_ctrl:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_mem_aux_ctrl_2_reg_t;

/** Type of mem_aux_ctrl_3 register
 *  mem aux control register 3
 */
typedef union {
    struct {
        /** sharp_matrix_y_mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  this field configures the mem_aux of sharp y line buffer memory
         */
        uint32_t sharp_matrix_y_mem_aux_ctrl:14;
        uint32_t reserved_14:2;
        /** demosaic_matrix_mem_aux_ctrl : R/W; bitpos: [29:16]; default: 4896;
         *  this field configures the mem_aux of demosaic line buffer memory
         */
        uint32_t demosaic_matrix_mem_aux_ctrl:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_mem_aux_ctrl_3_reg_t;

/** Type of mem_aux_ctrl_4 register
 *  mem aux control register 4
 */
typedef union {
    struct {
        /** sharp_matrix_uv_mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  this field configures the mem_aux of sharp uv line buffer memory
         */
        uint32_t sharp_matrix_uv_mem_aux_ctrl:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} isp_mem_aux_ctrl_4_reg_t;

/** Type of yuv_format register
 *  yuv format control register
 */
typedef union {
    struct {
        /** yuv_mode : R/W; bitpos: [0]; default: 0;
         *  this bit configures the yuv mode. 0: ITU-R BT.601, 1: ITU-R BT.709
         */
        uint32_t yuv_mode:1;
        /** yuv_range : R/W; bitpos: [1]; default: 0;
         *  this bit configures the yuv range. 0: full range, 1: limit range
         */
        uint32_t yuv_range:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} isp_yuv_format_reg_t;

/** Type of rdn_eco_low register
 *  rdn eco all low register
 */
typedef union {
    struct {
        /** rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  rdn_eco_low
         */
        uint32_t rdn_eco_low:32;
    };
    uint32_t val;
} isp_rdn_eco_low_reg_t;

/** Type of rdn_eco_high register
 *  rdn eco all high register
 */
typedef union {
    struct {
        /** rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  rdn_eco_high
         */
        uint32_t rdn_eco_high:32;
    };
    uint32_t val;
} isp_rdn_eco_high_reg_t;

/** Type of crop_ctrl register
 *  isp_crop ctrl register
 */
typedef union {
    struct {
        /** crop_sft_rst : WT; bitpos: [0]; default: 0;
         *  Write 1 to clear err st
         */
        uint32_t crop_sft_rst:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} isp_crop_ctrl_reg_t;

/** Type of crop_y_capture register
 *  isp_crop row capture range register
 */
typedef union {
    struct {
        /** crop_y_start : R/W; bitpos: [11:0]; default: 0;
         *  isp_crop capture row start index
         */
        uint32_t crop_y_start:12;
        /** crop_y_end : R/W; bitpos: [23:12]; default: 0;
         *  isp_crop capture row end index
         */
        uint32_t crop_y_end:12;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_crop_y_capture_reg_t;

/** Type of crop_x_capture register
 *  isp_crop col capture range register
 */
typedef union {
    struct {
        /** crop_x_start : R/W; bitpos: [11:0]; default: 0;
         *  isp_crop capture col start index
         */
        uint32_t crop_x_start:12;
        /** crop_x_end : R/W; bitpos: [23:12]; default: 0;
         *  isp_crop capture col end index
         */
        uint32_t crop_x_end:12;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_crop_x_capture_reg_t;

/** Type of crop_err_st register
 *  crop error state register
 */
typedef union {
    struct {
        /** crop_y_mismatch : RO; bitpos: [0]; default: 0;
         *  Represents isp_corp row end index over image size
         */
        uint32_t crop_y_mismatch:1;
        /** crop_x_mismatch : RO; bitpos: [1]; default: 0;
         *  Represents isp_corp col end index over image size
         */
        uint32_t crop_x_mismatch:1;
        /** crop_y_end_even : RO; bitpos: [2]; default: 0;
         *  Represents isp_corp row end index is an even number
         */
        uint32_t crop_y_end_even:1;
        /** crop_x_end_even : RO; bitpos: [3]; default: 0;
         *  Represents isp_corp col end index is an even number
         */
        uint32_t crop_x_end_even:1;
        /** crop_y_start_odd : RO; bitpos: [4]; default: 0;
         *  Represents isp_corp row start index is an odd number
         */
        uint32_t crop_y_start_odd:1;
        /** crop_x_start_odd : RO; bitpos: [5]; default: 0;
         *  Represents isp_corp col start index is an odd number
         */
        uint32_t crop_x_start_odd:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} isp_crop_err_st_reg_t;

/** Type of wbg_coef_r register
 *  white balance red gain register 0
 */
typedef union {
    struct {
        /** wbg_r : R/W; bitpos: [11:0]; default: 256;
         *  Configures the white balance red gain
         */
        uint32_t wbg_r:12;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} isp_wbg_coef_r_reg_t;

/** Type of wbg_coef_g register
 *  white balance green gain register 0
 */
typedef union {
    struct {
        /** wbg_g : R/W; bitpos: [11:0]; default: 256;
         *  Configures the white balance green gain
         */
        uint32_t wbg_g:12;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} isp_wbg_coef_g_reg_t;

/** Type of wbg_coef_b register
 *  white balance blue gain register 0
 */
typedef union {
    struct {
        /** wbg_b : R/W; bitpos: [11:0]; default: 256;
         *  Configures the white balance blue gain
         */
        uint32_t wbg_b:12;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} isp_wbg_coef_b_reg_t;

