espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of color_hue_ctrl register
 *  color control register
 */
typedef union {
    struct {
        /** color_hue_h : R/W; bitpos: [0]; default: 0;
         *  Configures the color hue angle most bit
         */
        uint32_t color_hue_h:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} isp_color_hue_ctrl_reg_t;

/** Type of awb_bx register
 *  awb window register in x-direction
 */
typedef union {
    struct {
        /** awb_x_bsize : R/W; bitpos: [11:0]; default: 0;
         *  Configures every block x size, min number is 4
         */
        uint32_t awb_x_bsize:12;
        /** awb_x_start : R/W; bitpos: [23:12]; default: 0;
         *  Configures first block start x address
         */
        uint32_t awb_x_start:12;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_awb_bx_reg_t;

/** Type of awb_by register
 *  awb window register in y-direction
 */
typedef union {
    struct {
        /** awb_y_bsize : R/W; bitpos: [11:0]; default: 0;
         *  Configures every block y size
         */
        uint32_t awb_y_bsize:12;
        /** awb_y_start : R/W; bitpos: [23:12]; default: 0;
         *  Configures first block start y address
         */
        uint32_t awb_y_start:12;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_awb_by_reg_t;

/** Type of state register
 *  awb window register in y-direction
 */
typedef union {
    struct {
        /** tail_busy : RO; bitpos: [0]; default: 0;
         *  Represents isp_tail state
         */
        uint32_t tail_busy:1;
        /** header_busy : RO; bitpos: [1]; default: 0;
         *  Represents isp_header state
         */
        uint32_t header_busy:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} isp_state_reg_t;

/** Type of shadow_reg_ctrl register
 *  shadow register ctrl register
 */
typedef union {
    struct {
        /** blc_update : R/W; bitpos: [0]; default: 0;
         *  Write 1 to update blc configuration register
         */
        uint32_t blc_update:1;
        /** dpc_update : R/W; bitpos: [1]; default: 0;
         *  Write 1 to update dpc configuration register
         */
        uint32_t dpc_update:1;
        /** bf_update : R/W; bitpos: [2]; default: 0;
         *  Write 1 to update bf configuration register
         */
        uint32_t bf_update:1;
        /** wbg_update : R/W; bitpos: [3]; default: 0;
         *  Write 1 to update wbg configuration register
         */
        uint32_t wbg_update:1;
        /** ccm_update : R/W; bitpos: [4]; default: 0;
         *  Write 1 to update ccm configuration register
         */
        uint32_t ccm_update:1;
        uint32_t reserved_5:1;
        /** sharp_update : R/W; bitpos: [6]; default: 0;
         *  Write 1 to update sharp configuration register
         */
        uint32_t sharp_update:1;
        /** color_update : R/W; bitpos: [7]; default: 0;
         *  Write 1 to update color configuration register
         */
        uint32_t color_update:1;
        uint32_t reserved_8:22;
        /** shadow_update_sel : R/W; bitpos: [31:30]; default: 1;
         *  Configures shadow register update type. 0: no shadow register. 1: update every
         *  vsyn. 2: update only the next vsync after write reg_xxx_update
         */
        uint32_t shadow_update_sel:2;
    };
    uint32_t val;
} isp_shadow_reg_ctrl_reg_t;


/** Group: Status Registers */
/** Type of dpc_deadpix_cnt register
 *  DPC dead-pix number register
 */
typedef union {
    struct {
        /** dpc_deadpix_cnt : RO; bitpos: [9:0]; default: 0;
         *  this field represents the dead pixel count
         */
        uint32_t dpc_deadpix_cnt:10;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} isp_dpc_deadpix_cnt_reg_t;

/** Type of lut_rdata register
 *  LUT read data register
 */
typedef union {
    struct {
        /** lut_rdata : RO; bitpos: [31:0]; default: 0;
         *  this field represents the read data of lut. read ISP_LUT_RDATA after write
         *  ISP_LUT_CMD register
         */
        uint32_t lut_rdata:32;
    };
    uint32_t val;
} isp_lut_rdata_reg_t;

/** Type of ae_block_mean_0 register
 *  ae statistic result register 0
 */
typedef union {
    struct {
        /** ae_b03_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block03 Y mean data
         */
        uint32_t ae_b03_mean:8;
        /** ae_b02_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block02 Y mean data
         */
        uint32_t ae_b02_mean:8;
        /** ae_b01_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block01 Y mean data
         */
        uint32_t ae_b01_mean:8;
        /** ae_b00_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block00 Y mean data
         */
        uint32_t ae_b00_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_0_reg_t;

/** Type of ae_block_mean_1 register
 *  ae statistic result register 1
 */
typedef union {
    struct {
        /** ae_b12_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block12 Y mean data
         */
        uint32_t ae_b12_mean:8;
        /** ae_b11_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block11 Y mean data
         */
        uint32_t ae_b11_mean:8;
        /** ae_b10_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block10 Y mean data
         */
        uint32_t ae_b10_mean:8;
        /** ae_b04_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block04 Y mean data
         */
        uint32_t ae_b04_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_1_reg_t;

/** Type of ae_block_mean_2 register
 *  ae statistic result register 2
 */
typedef union {
    struct {
        /** ae_b21_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block21 Y mean data
         */
        uint32_t ae_b21_mean:8;
        /** ae_b20_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block20 Y mean data
         */
        uint32_t ae_b20_mean:8;
        /** ae_b14_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block14 Y mean data
         */
        uint32_t ae_b14_mean:8;
        /** ae_b13_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block13 Y mean data
         */
        uint32_t ae_b13_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_2_reg_t;

