espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of ae_block_mean_3 register
 *  ae statistic result register 3
 */
typedef union {
    struct {
        /** ae_b30_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block30 Y mean data
         */
        uint32_t ae_b30_mean:8;
        /** ae_b24_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block24 Y mean data
         */
        uint32_t ae_b24_mean:8;
        /** ae_b23_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block23 Y mean data
         */
        uint32_t ae_b23_mean:8;
        /** ae_b22_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block22 Y mean data
         */
        uint32_t ae_b22_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_3_reg_t;

/** Type of ae_block_mean_4 register
 *  ae statistic result register 4
 */
typedef union {
    struct {
        /** ae_b34_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block34 Y mean data
         */
        uint32_t ae_b34_mean:8;
        /** ae_b33_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block33 Y mean data
         */
        uint32_t ae_b33_mean:8;
        /** ae_b32_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block32 Y mean data
         */
        uint32_t ae_b32_mean:8;
        /** ae_b31_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block31 Y mean data
         */
        uint32_t ae_b31_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_4_reg_t;

/** Type of ae_block_mean_5 register
 *  ae statistic result register 5
 */
typedef union {
    struct {
        /** ae_b43_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block43 Y mean data
         */
        uint32_t ae_b43_mean:8;
        /** ae_b42_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block42 Y mean data
         */
        uint32_t ae_b42_mean:8;
        /** ae_b41_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block41 Y mean data
         */
        uint32_t ae_b41_mean:8;
        /** ae_b40_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block40 Y mean data
         */
        uint32_t ae_b40_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_5_reg_t;

/** Type of ae_block_mean_6 register
 *  ae statistic result register 6
 */
typedef union {
    struct {
        uint32_t reserved_0:24;
        /** ae_b44_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block44 Y mean data
         */
        uint32_t ae_b44_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_6_reg_t;

/** Type of af_sum_a register
 *  result of sum of af window a
 */
typedef union {
    struct {
        /** af_suma : RO; bitpos: [29:0]; default: 0;
         *  this field represents the result of accumulation of pix grad of focus window a
         */
        uint32_t af_suma:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_af_sum_a_reg_t;

/** Type of af_sum_b register
 *  result of sum of af window b
 */
typedef union {
    struct {
        /** af_sumb : RO; bitpos: [29:0]; default: 0;
         *  this field represents the result of accumulation of pix grad of focus window b
         */
        uint32_t af_sumb:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_af_sum_b_reg_t;

/** Type of af_sum_c register
 *  result of sum of af window c
 */
typedef union {
    struct {
        /** af_sumc : RO; bitpos: [29:0]; default: 0;
         *  this field represents the result of accumulation of pix grad of focus window c
         */
        uint32_t af_sumc:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_af_sum_c_reg_t;

/** Type of af_lum_a register
 *  result of lum of af window a
 */
typedef union {
    struct {
        /** af_luma : RO; bitpos: [27:0]; default: 0;
         *  this field represents the result of accumulation of pix light of focus window a
         */
        uint32_t af_luma:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_lum_a_reg_t;

/** Type of af_lum_b register
 *  result of lum of af window b
 */
typedef union {
    struct {
        /** af_lumb : RO; bitpos: [27:0]; default: 0;
         *  this field represents the result of accumulation of pix light of focus window b
         */
        uint32_t af_lumb:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_lum_b_reg_t;

/** Type of af_lum_c register
 *  result of lum of af window c
 */
typedef union {
    struct {
        /** af_lumc : RO; bitpos: [27:0]; default: 0;
         *  this field represents the result of accumulation of pix light of focus window c
         */
        uint32_t af_lumc:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_lum_c_reg_t;

/** Type of awb0_white_cnt register
 *  result of awb white point number
 */
typedef union {
    struct {
        /** awb0_white_cnt : RO; bitpos: [23:0]; default: 0;
         *  this field configures number of white point detected of algo0
         */
        uint32_t awb0_white_cnt:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_awb0_white_cnt_reg_t;

/** Type of awb0_acc_r register
 *  result of accumulate of r channel of all white points
 */
typedef union {
    struct {
        /** awb0_acc_r : RO; bitpos: [31:0]; default: 0;
         *  this field represents accumulate of channel r of all white point of algo0
         */
        uint32_t awb0_acc_r:32;
    };
    uint32_t val;
} isp_awb0_acc_r_reg_t;

/** Type of awb0_acc_g register
 *  result of accumulate of g channel of all white points
 */
typedef union {
    struct {
        /** awb0_acc_g : RO; bitpos: [31:0]; default: 0;
         *  this field represents accumulate of channel g of all white point of algo0
         */
        uint32_t awb0_acc_g:32;
    };
    uint32_t val;
} isp_awb0_acc_g_reg_t;

/** Type of awb0_acc_b register
 *  result of accumulate of b channel of all white points
 */
typedef union {
    struct {
        /** awb0_acc_b : RO; bitpos: [31:0]; default: 0;
         *  this field represents accumulate of channel b of all white point of algo0
         */
        uint32_t awb0_acc_b:32;
    };
    uint32_t val;
} isp_awb0_acc_b_reg_t;

/** Type of blc_mean register
 *  results of the average of black window
 */
typedef union {
    struct {
        /** blc_r3_mean : RO; bitpos: [7:0]; default: 0;
         *  this field represents the average black value of bottom right channel
         */
        uint32_t blc_r3_mean:8;
        /** blc_r2_mean : RO; bitpos: [15:8]; default: 0;
         *  this field represents the average black value of bottom left channel
         */
        uint32_t blc_r2_mean:8;
        /** blc_r1_mean : RO; bitpos: [23:16]; default: 0;
         *  this field represents the average black value of top right channel
         */
        uint32_t blc_r1_mean:8;
        /** blc_r0_mean : RO; bitpos: [31:24]; default: 0;
         *  this field represents the average black value of top left channel
         */
        uint32_t blc_r0_mean:8;
    };
    uint32_t val;
} isp_blc_mean_reg_t;

/** Type of hist_bin0 register
 *  result of histogram bin 0
 */
typedef union {
    struct {
        /** hist_bin_0 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 0
         */
        uint32_t hist_bin_0:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin0_reg_t;

/** Type of hist_bin1 register
 *  result of histogram bin 1
 */
typedef union {
    struct {
        /** hist_bin_1 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 1
         */
        uint32_t hist_bin_1:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin1_reg_t;

/** Type of hist_bin2 register
 *  result of histogram bin 2
 */
typedef union {
    struct {
        /** hist_bin_2 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 2
         */
        uint32_t hist_bin_2:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin2_reg_t;

