espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of hist_bin3 register
 *  result of histogram bin 3
 */
typedef union {
    struct {
        /** hist_bin_3 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 3
         */
        uint32_t hist_bin_3:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin3_reg_t;

/** Type of hist_bin4 register
 *  result of histogram bin 4
 */
typedef union {
    struct {
        /** hist_bin_4 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 4
         */
        uint32_t hist_bin_4:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin4_reg_t;

/** Type of hist_bin5 register
 *  result of histogram bin 5
 */
typedef union {
    struct {
        /** hist_bin_5 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 5
         */
        uint32_t hist_bin_5:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin5_reg_t;

/** Type of hist_bin6 register
 *  result of histogram bin 6
 */
typedef union {
    struct {
        /** hist_bin_6 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 6
         */
        uint32_t hist_bin_6:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin6_reg_t;

/** Type of hist_bin7 register
 *  result of histogram bin 7
 */
typedef union {
    struct {
        /** hist_bin_7 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 7
         */
        uint32_t hist_bin_7:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin7_reg_t;

/** Type of hist_bin8 register
 *  result of histogram bin 8
 */
typedef union {
    struct {
        /** hist_bin_8 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 8
         */
        uint32_t hist_bin_8:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin8_reg_t;

/** Type of hist_bin9 register
 *  result of histogram bin 9
 */
typedef union {
    struct {
        /** hist_bin_9 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 9
         */
        uint32_t hist_bin_9:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin9_reg_t;

/** Type of hist_bin10 register
 *  result of histogram bin 10
 */
typedef union {
    struct {
        /** hist_bin_10 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 10
         */
        uint32_t hist_bin_10:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin10_reg_t;

/** Type of hist_bin11 register
 *  result of histogram bin 11
 */
typedef union {
    struct {
        /** hist_bin_11 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 11
         */
        uint32_t hist_bin_11:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin11_reg_t;

/** Type of hist_bin12 register
 *  result of histogram bin 12
 */
typedef union {
    struct {
        /** hist_bin_12 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 12
         */
        uint32_t hist_bin_12:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin12_reg_t;

/** Type of hist_bin13 register
 *  result of histogram bin 13
 */
typedef union {
    struct {
        /** hist_bin_13 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 13
         */
        uint32_t hist_bin_13:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin13_reg_t;

/** Type of hist_bin14 register
 *  result of histogram bin 14
 */
typedef union {
    struct {
        /** hist_bin_14 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 14
         */
        uint32_t hist_bin_14:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin14_reg_t;

/** Type of hist_bin15 register
 *  result of histogram bin 15
 */
typedef union {
    struct {
        /** hist_bin_15 : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin 15
         */
        uint32_t hist_bin_15:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_bin15_reg_t;

/** Type of rdn_eco_cs register
 *  rdn eco cs register
 */
typedef union {
    struct {
        /** rdn_eco_en : R/W; bitpos: [0]; default: 0;
         *  rdn_eco_en
         */
        uint32_t rdn_eco_en:1;
        /** rdn_eco_result : RO; bitpos: [1]; default: 0;
         *  rdn_eco_result
         */
        uint32_t rdn_eco_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} isp_rdn_eco_cs_reg_t;


/** Group: Interrupt Registers */
/** Type of int_raw register
 *  raw interrupt register
 */
typedef union {
    struct {
        /** isp_data_type_err_int_raw : R/SS/WTC; bitpos: [0]; default: 0;
         *  the raw interrupt status of input data type error. isp only support RGB bayer data
         *  type, other type will report type_err_int
         */
        uint32_t isp_data_type_err_int_raw:1;
        /** isp_async_fifo_ovf_int_raw : R/SS/WTC; bitpos: [1]; default: 0;
         *  the raw interrupt status of isp input fifo overflow
         */
        uint32_t isp_async_fifo_ovf_int_raw:1;
        /** isp_buf_full_int_raw : R/SS/WTC; bitpos: [2]; default: 0;
         *  the raw interrupt status of isp input buffer full
         */
        uint32_t isp_buf_full_int_raw:1;
        /** isp_hvnum_setting_err_int_raw : R/SS/WTC; bitpos: [3]; default: 0;
         *  the raw interrupt status of hnum and vnum setting format error
         */
        uint32_t isp_hvnum_setting_err_int_raw:1;
        /** isp_data_type_setting_err_int_raw : R/SS/WTC; bitpos: [4]; default: 0;
         *  the raw interrupt status of setting invalid reg_data_type
         */
        uint32_t isp_data_type_setting_err_int_raw:1;
        /** isp_mipi_hnum_unmatch_int_raw : R/SS/WTC; bitpos: [5]; default: 0;
         *  the raw interrupt status of hnum setting unmatch with mipi input
         */
        uint32_t isp_mipi_hnum_unmatch_int_raw:1;
        /** dpc_check_done_int_raw : R/SS/WTC; bitpos: [6]; default: 0;
         *  the raw interrupt status of dpc check done
         */
        uint32_t dpc_check_done_int_raw:1;
        /** gamma_xcoord_err_int_raw : R/SS/WTC; bitpos: [7]; default: 0;
         *  the raw interrupt status of gamma setting error. it report the sum of the lengths
         *  represented by reg_gamma_x00~x0F isn't equal to 256
         */
        uint32_t gamma_xcoord_err_int_raw:1;
        /** ae_monitor_int_raw : R/SS/WTC; bitpos: [8]; default: 0;
         *  the raw interrupt status of ae monitor
         */
        uint32_t ae_monitor_int_raw:1;
        /** ae_frame_done_int_raw : R/SS/WTC; bitpos: [9]; default: 0;
         *  the raw interrupt status of ae.
         */
        uint32_t ae_frame_done_int_raw:1;
        /** af_fdone_int_raw : R/SS/WTC; bitpos: [10]; default: 0;
         *  the raw interrupt status of af statistic. when auto_update enable, each frame done
         *  will send one int pulse when manual_update, each time when write 1 to
         *  reg_manual_update will send a int pulse when next frame done
         */
        uint32_t af_fdone_int_raw:1;
        /** af_env_int_raw : R/SS/WTC; bitpos: [11]; default: 0;
         *  the raw interrupt status of af monitor. send a int pulse when env_det function
         *  enabled and environment changes detected
         */
        uint32_t af_env_int_raw:1;
        /** awb_fdone_int_raw : R/SS/WTC; bitpos: [12]; default: 0;
         *  the raw interrupt status of awb. send a int pulse when statistic of one awb frame
         *  done
         */
        uint32_t awb_fdone_int_raw:1;
        /** hist_fdone_int_raw : R/SS/WTC; bitpos: [13]; default: 0;
         *  the raw interrupt status of histogram. send a int pulse when statistic of one frame
         *  histogram done
         */
        uint32_t hist_fdone_int_raw:1;
        /** frame_int_raw : R/SS/WTC; bitpos: [14]; default: 0;
         *  the raw interrupt status of isp frame end
         */
        uint32_t frame_int_raw:1;
        /** blc_frame_int_raw : R/SS/WTC; bitpos: [15]; default: 0;
         *  the raw interrupt status of blc frame done
         */
        uint32_t blc_frame_int_raw:1;
        /** lsc_frame_int_raw : R/SS/WTC; bitpos: [16]; default: 0;
         *  the raw interrupt status of lsc frame done
         */
        uint32_t lsc_frame_int_raw:1;
        /** dpc_frame_int_raw : R/SS/WTC; bitpos: [17]; default: 0;
         *  the raw interrupt status of dpc frame done
         */
        uint32_t dpc_frame_int_raw:1;
        /** bf_frame_int_raw : R/SS/WTC; bitpos: [18]; default: 0;
         *  the raw interrupt status of bf frame done
         */
        uint32_t bf_frame_int_raw:1;
        /** demosaic_frame_int_raw : R/SS/WTC; bitpos: [19]; default: 0;
         *  the raw interrupt status of demosaic frame done
         */
        uint32_t demosaic_frame_int_raw:1;
        /** median_frame_int_raw : R/SS/WTC; bitpos: [20]; default: 0;
         *  the raw interrupt status of median frame done
         */
        uint32_t median_frame_int_raw:1;
        /** ccm_frame_int_raw : R/SS/WTC; bitpos: [21]; default: 0;
         *  the raw interrupt status of ccm frame done
         */
        uint32_t ccm_frame_int_raw:1;
        /** gamma_frame_int_raw : R/SS/WTC; bitpos: [22]; default: 0;
         *  the raw interrupt status of gamma frame done
         */
        uint32_t gamma_frame_int_raw:1;
        /** rgb2yuv_frame_int_raw : R/SS/WTC; bitpos: [23]; default: 0;
         *  the raw interrupt status of rgb2yuv frame done
         */
        uint32_t rgb2yuv_frame_int_raw:1;
        /** sharp_frame_int_raw : R/SS/WTC; bitpos: [24]; default: 0;
         *  the raw interrupt status of sharp frame done
         */
        uint32_t sharp_frame_int_raw:1;
        /** color_frame_int_raw : R/SS/WTC; bitpos: [25]; default: 0;
         *  the raw interrupt status of color frame done
         */
        uint32_t color_frame_int_raw:1;
        /** yuv2rgb_frame_int_raw : R/SS/WTC; bitpos: [26]; default: 0;
         *  the raw interrupt status of yuv2rgb frame done
         */
        uint32_t yuv2rgb_frame_int_raw:1;
        /** tail_idi_frame_int_raw : R/SS/WTC; bitpos: [27]; default: 0;
         *  the raw interrupt status of isp_tail idi frame_end
         */
        uint32_t tail_idi_frame_int_raw:1;
        /** header_idi_frame_int_raw : R/SS/WTC; bitpos: [28]; default: 0;
         *  the raw interrupt status of real input frame end of isp_input
         */
        uint32_t header_idi_frame_int_raw:1;
        /** crop_frame_int_raw : R/SS/WTC; bitpos: [29]; default: 0;
         *  the raw interrupt status of crop frame done
         */
        uint32_t crop_frame_int_raw:1;
        /** wbg_frame_int_raw : R/SS/WTC; bitpos: [30]; default: 0;
         *  the raw interrupt status of wbg frame done
         */
        uint32_t wbg_frame_int_raw:1;
        /** crop_err_int_raw : R/SS/WTC; bitpos: [31]; default: 0;
         *  the raw interrupt status of crop error
         */
        uint32_t crop_err_int_raw:1;
    };
    uint32_t val;
} isp_int_raw_reg_t;

/** Type of int_st register
 *  masked interrupt register
 */
typedef union {
    struct {
        /** isp_data_type_err_int_st : RO; bitpos: [0]; default: 0;
         *  the masked interrupt status of input data type error
         */
        uint32_t isp_data_type_err_int_st:1;
        /** isp_async_fifo_ovf_int_st : RO; bitpos: [1]; default: 0;
         *  the masked interrupt status of isp input fifo overflow
         */
        uint32_t isp_async_fifo_ovf_int_st:1;
        /** isp_buf_full_int_st : RO; bitpos: [2]; default: 0;
         *  the masked interrupt status of isp input buffer full
         */
        uint32_t isp_buf_full_int_st:1;
        /** isp_hvnum_setting_err_int_st : RO; bitpos: [3]; default: 0;
         *  the masked interrupt status of hnum and vnum setting format error
         */
        uint32_t isp_hvnum_setting_err_int_st:1;
        /** isp_data_type_setting_err_int_st : RO; bitpos: [4]; default: 0;
         *  the masked interrupt status of setting invalid reg_data_type
         */
        uint32_t isp_data_type_setting_err_int_st:1;
        /** isp_mipi_hnum_unmatch_int_st : RO; bitpos: [5]; default: 0;
         *  the masked interrupt status of hnum setting unmatch with mipi input
         */
        uint32_t isp_mipi_hnum_unmatch_int_st:1;
        /** dpc_check_done_int_st : RO; bitpos: [6]; default: 0;
         *  the masked interrupt status of dpc check done
         */
        uint32_t dpc_check_done_int_st:1;
        /** gamma_xcoord_err_int_st : RO; bitpos: [7]; default: 0;
         *  the masked interrupt status of gamma setting error
         */
        uint32_t gamma_xcoord_err_int_st:1;
        /** ae_monitor_int_st : RO; bitpos: [8]; default: 0;
         *  the masked interrupt status of ae monitor
         */
        uint32_t ae_monitor_int_st:1;
        /** ae_frame_done_int_st : RO; bitpos: [9]; default: 0;
         *  the masked interrupt status of ae
         */
        uint32_t ae_frame_done_int_st:1;
        /** af_fdone_int_st : RO; bitpos: [10]; default: 0;
         *  the masked interrupt status of af statistic
         */
        uint32_t af_fdone_int_st:1;
        /** af_env_int_st : RO; bitpos: [11]; default: 0;
         *  the masked interrupt status of af monitor
         */
        uint32_t af_env_int_st:1;
        /** awb_fdone_int_st : RO; bitpos: [12]; default: 0;
         *  the masked interrupt status of awb
         */
        uint32_t awb_fdone_int_st:1;
        /** hist_fdone_int_st : RO; bitpos: [13]; default: 0;
         *  the masked interrupt status of histogram
         */
        uint32_t hist_fdone_int_st:1;
        /** frame_int_st : RO; bitpos: [14]; default: 0;
         *  the masked interrupt status of isp frame end
         */
        uint32_t frame_int_st:1;
        /** blc_frame_int_st : RO; bitpos: [15]; default: 0;
         *  the masked interrupt status of blc frame done
         */
        uint32_t blc_frame_int_st:1;
        /** lsc_frame_int_st : RO; bitpos: [16]; default: 0;
         *  the masked interrupt status of lsc frame done
         */
        uint32_t lsc_frame_int_st:1;
        /** dpc_frame_int_st : RO; bitpos: [17]; default: 0;
         *  the masked interrupt status of dpc frame done
         */
        uint32_t dpc_frame_int_st:1;
        /** bf_frame_int_st : RO; bitpos: [18]; default: 0;
         *  the masked interrupt status of bf frame done
         */
        uint32_t bf_frame_int_st:1;
        /** demosaic_frame_int_st : RO; bitpos: [19]; default: 0;
         *  the masked interrupt status of demosaic frame done
         */
        uint32_t demosaic_frame_int_st:1;
        /** median_frame_int_st : RO; bitpos: [20]; default: 0;
         *  the masked interrupt status of median frame done
         */
        uint32_t median_frame_int_st:1;
        /** ccm_frame_int_st : RO; bitpos: [21]; default: 0;
         *  the masked interrupt status of ccm frame done
         */
        uint32_t ccm_frame_int_st:1;
        /** gamma_frame_int_st : RO; bitpos: [22]; default: 0;
         *  the masked interrupt status of gamma frame done
         */
        uint32_t gamma_frame_int_st:1;
        /** rgb2yuv_frame_int_st : RO; bitpos: [23]; default: 0;
         *  the masked interrupt status of rgb2yuv frame done
         */
        uint32_t rgb2yuv_frame_int_st:1;
        /** sharp_frame_int_st : RO; bitpos: [24]; default: 0;
         *  the masked interrupt status of sharp frame done
         */
        uint32_t sharp_frame_int_st:1;
        /** color_frame_int_st : RO; bitpos: [25]; default: 0;
         *  the masked interrupt status of color frame done
         */
        uint32_t color_frame_int_st:1;
        /** yuv2rgb_frame_int_st : RO; bitpos: [26]; default: 0;
         *  the masked interrupt status of yuv2rgb frame done
         */
        uint32_t yuv2rgb_frame_int_st:1;
        /** tail_idi_frame_int_st : RO; bitpos: [27]; default: 0;
         *  the masked interrupt status of isp_tail idi frame_end
         */
        uint32_t tail_idi_frame_int_st:1;
        /** header_idi_frame_int_st : RO; bitpos: [28]; default: 0;
         *  the masked interrupt status of real input frame end of isp_input
         */
        uint32_t header_idi_frame_int_st:1;
        /** crop_frame_int_st : RO; bitpos: [29]; default: 0;
         *  the masked interrupt status of crop frame done
         */
        uint32_t crop_frame_int_st:1;
        /** wbg_frame_int_st : RO; bitpos: [30]; default: 0;
         *  the masked interrupt status of wbg frame done
         */
        uint32_t wbg_frame_int_st:1;
        /** crop_err_int_st : RO; bitpos: [31]; default: 0;
         *  the masked interrupt status of crop error
         */
        uint32_t crop_err_int_st:1;
    };
    uint32_t val;
} isp_int_st_reg_t;

/** Type of int_ena register
 *  interrupt enable register
 */
typedef union {
    struct {
        /** isp_data_type_err_int_ena : R/W; bitpos: [0]; default: 1;
         *  write 1 to enable input data type error
         */
        uint32_t isp_data_type_err_int_ena:1;
        /** isp_async_fifo_ovf_int_ena : R/W; bitpos: [1]; default: 1;
         *  write 1 to enable isp input fifo overflow
         */
        uint32_t isp_async_fifo_ovf_int_ena:1;
        /** isp_buf_full_int_ena : R/W; bitpos: [2]; default: 0;
         *  write 1 to enable isp input buffer full
         */
        uint32_t isp_buf_full_int_ena:1;
        /** isp_hvnum_setting_err_int_ena : R/W; bitpos: [3]; default: 0;
         *  write 1 to enable hnum and vnum setting format error
         */
        uint32_t isp_hvnum_setting_err_int_ena:1;
        /** isp_data_type_setting_err_int_ena : R/W; bitpos: [4]; default: 0;
         *  write 1 to enable setting invalid reg_data_type
         */
        uint32_t isp_data_type_setting_err_int_ena:1;
        /** isp_mipi_hnum_unmatch_int_ena : R/W; bitpos: [5]; default: 0;
         *  write 1 to enable hnum setting unmatch with mipi input
         */
        uint32_t isp_mipi_hnum_unmatch_int_ena:1;
        /** dpc_check_done_int_ena : R/W; bitpos: [6]; default: 1;
         *  write 1 to enable dpc check done
         */
        uint32_t dpc_check_done_int_ena:1;
        /** gamma_xcoord_err_int_ena : R/W; bitpos: [7]; default: 1;
         *  write 1 to enable gamma setting error
         */
        uint32_t gamma_xcoord_err_int_ena:1;
        /** ae_monitor_int_ena : R/W; bitpos: [8]; default: 0;
         *  write 1 to enable ae monitor
         */
        uint32_t ae_monitor_int_ena:1;
        /** ae_frame_done_int_ena : R/W; bitpos: [9]; default: 0;
         *  write 1 to enable ae
         */
        uint32_t ae_frame_done_int_ena:1;
        /** af_fdone_int_ena : R/W; bitpos: [10]; default: 0;
         *  write 1 to enable af statistic
         */
        uint32_t af_fdone_int_ena:1;
        /** af_env_int_ena : R/W; bitpos: [11]; default: 0;
         *  write 1 to enable af monitor
         */
        uint32_t af_env_int_ena:1;
        /** awb_fdone_int_ena : R/W; bitpos: [12]; default: 0;
         *  write 1 to enable awb
         */
        uint32_t awb_fdone_int_ena:1;
        /** hist_fdone_int_ena : R/W; bitpos: [13]; default: 0;
         *  write 1 to enable histogram
         */
        uint32_t hist_fdone_int_ena:1;
        /** frame_int_ena : R/W; bitpos: [14]; default: 0;
         *  write 1 to enable isp frame end
         */
        uint32_t frame_int_ena:1;
        /** blc_frame_int_ena : R/W; bitpos: [15]; default: 0;
         *  write 1 to enable blc frame done
         */
        uint32_t blc_frame_int_ena:1;
        /** lsc_frame_int_ena : R/W; bitpos: [16]; default: 0;
         *  write 1 to enable lsc frame done
         */
        uint32_t lsc_frame_int_ena:1;
        /** dpc_frame_int_ena : R/W; bitpos: [17]; default: 0;
         *  write 1 to enable dpc frame done
         */
        uint32_t dpc_frame_int_ena:1;
        /** bf_frame_int_ena : R/W; bitpos: [18]; default: 0;
         *  write 1 to enable bf frame done
         */
        uint32_t bf_frame_int_ena:1;
        /** demosaic_frame_int_ena : R/W; bitpos: [19]; default: 0;
         *  write 1 to enable demosaic frame done
         */
        uint32_t demosaic_frame_int_ena:1;
        /** median_frame_int_ena : R/W; bitpos: [20]; default: 0;
         *  write 1 to enable median frame done
         */
        uint32_t median_frame_int_ena:1;
        /** ccm_frame_int_ena : R/W; bitpos: [21]; default: 0;
         *  write 1 to enable ccm frame done
         */
        uint32_t ccm_frame_int_ena:1;
        /** gamma_frame_int_ena : R/W; bitpos: [22]; default: 0;
         *  write 1 to enable gamma frame done
         */
        uint32_t gamma_frame_int_ena:1;
        /** rgb2yuv_frame_int_ena : R/W; bitpos: [23]; default: 0;
         *  write 1 to enable rgb2yuv frame done
         */
        uint32_t rgb2yuv_frame_int_ena:1;
        /** sharp_frame_int_ena : R/W; bitpos: [24]; default: 0;
         *  write 1 to enable sharp frame done
         */
        uint32_t sharp_frame_int_ena:1;
        /** color_frame_int_ena : R/W; bitpos: [25]; default: 0;
         *  write 1 to enable color frame done
         */
        uint32_t color_frame_int_ena:1;
        /** yuv2rgb_frame_int_ena : R/W; bitpos: [26]; default: 0;
         *  write 1 to enable yuv2rgb frame done
         */
        uint32_t yuv2rgb_frame_int_ena:1;
        /** tail_idi_frame_int_ena : R/W; bitpos: [27]; default: 0;
         *  write 1 to enable isp_tail idi frame_end
         */
        uint32_t tail_idi_frame_int_ena:1;
        /** header_idi_frame_int_ena : R/W; bitpos: [28]; default: 0;
         *  write 1 to enable real input frame end of isp_input
         */
        uint32_t header_idi_frame_int_ena:1;
        /** crop_frame_int_ena : R/W; bitpos: [29]; default: 0;
         *  write 1 to enable crop frame done
         */
        uint32_t crop_frame_int_ena:1;
        /** wbg_frame_int_ena : R/W; bitpos: [30]; default: 0;
         *  write 1 to enable wbg frame done
         */
        uint32_t wbg_frame_int_ena:1;
        /** crop_err_int_ena : R/W; bitpos: [31]; default: 0;
         *  write 1 to enable crop error
         */
        uint32_t crop_err_int_ena:1;
    };
    uint32_t val;
} isp_int_ena_reg_t;

