espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/isp_eco5_struct.h
/** Type of int_clr register
 *  interrupt clear register
 */
typedef union {
    struct {
        /** isp_data_type_err_int_clr : WT; bitpos: [0]; default: 0;
         *  write 1 to clear input data type error
         */
        uint32_t isp_data_type_err_int_clr:1;
        /** isp_async_fifo_ovf_int_clr : WT; bitpos: [1]; default: 0;
         *  write 1 to clear isp input fifo overflow
         */
        uint32_t isp_async_fifo_ovf_int_clr:1;
        /** isp_buf_full_int_clr : WT; bitpos: [2]; default: 0;
         *  write 1 to clear isp input buffer full
         */
        uint32_t isp_buf_full_int_clr:1;
        /** isp_hvnum_setting_err_int_clr : WT; bitpos: [3]; default: 0;
         *  write 1 to clear hnum and vnum setting format error
         */
        uint32_t isp_hvnum_setting_err_int_clr:1;
        /** isp_data_type_setting_err_int_clr : WT; bitpos: [4]; default: 0;
         *  write 1 to clear setting invalid reg_data_type
         */
        uint32_t isp_data_type_setting_err_int_clr:1;
        /** isp_mipi_hnum_unmatch_int_clr : WT; bitpos: [5]; default: 0;
         *  write 1 to clear hnum setting unmatch with mipi input
         */
        uint32_t isp_mipi_hnum_unmatch_int_clr:1;
        /** dpc_check_done_int_clr : WT; bitpos: [6]; default: 0;
         *  write 1 to clear dpc check done
         */
        uint32_t dpc_check_done_int_clr:1;
        /** gamma_xcoord_err_int_clr : WT; bitpos: [7]; default: 0;
         *  write 1 to clear gamma setting error
         */
        uint32_t gamma_xcoord_err_int_clr:1;
        /** ae_monitor_int_clr : WT; bitpos: [8]; default: 0;
         *  write 1 to clear ae monitor
         */
        uint32_t ae_monitor_int_clr:1;
        /** ae_frame_done_int_clr : WT; bitpos: [9]; default: 0;
         *  write 1 to clear ae
         */
        uint32_t ae_frame_done_int_clr:1;
        /** af_fdone_int_clr : WT; bitpos: [10]; default: 0;
         *  write 1 to clear af statistic
         */
        uint32_t af_fdone_int_clr:1;
        /** af_env_int_clr : WT; bitpos: [11]; default: 0;
         *  write 1 to clear af monitor
         */
        uint32_t af_env_int_clr:1;
        /** awb_fdone_int_clr : WT; bitpos: [12]; default: 0;
         *  write 1 to clear awb
         */
        uint32_t awb_fdone_int_clr:1;
        /** hist_fdone_int_clr : WT; bitpos: [13]; default: 0;
         *  write 1 to clear histogram
         */
        uint32_t hist_fdone_int_clr:1;
        /** frame_int_clr : WT; bitpos: [14]; default: 0;
         *  write 1 to clear isp frame end
         */
        uint32_t frame_int_clr:1;
        /** blc_frame_int_clr : WT; bitpos: [15]; default: 0;
         *  write 1 to clear blc frame done
         */
        uint32_t blc_frame_int_clr:1;
        /** lsc_frame_int_clr : WT; bitpos: [16]; default: 0;
         *  write 1 to clear lsc frame done
         */
        uint32_t lsc_frame_int_clr:1;
        /** dpc_frame_int_clr : WT; bitpos: [17]; default: 0;
         *  write 1 to clear dpc frame done
         */
        uint32_t dpc_frame_int_clr:1;
        /** bf_frame_int_clr : WT; bitpos: [18]; default: 0;
         *  write 1 to clear bf frame done
         */
        uint32_t bf_frame_int_clr:1;
        /** demosaic_frame_int_clr : WT; bitpos: [19]; default: 0;
         *  write 1 to clear demosaic frame done
         */
        uint32_t demosaic_frame_int_clr:1;
        /** median_frame_int_clr : WT; bitpos: [20]; default: 0;
         *  write 1 to clear median frame done
         */
        uint32_t median_frame_int_clr:1;
        /** ccm_frame_int_clr : WT; bitpos: [21]; default: 0;
         *  write 1 to clear ccm frame done
         */
        uint32_t ccm_frame_int_clr:1;
        /** gamma_frame_int_clr : WT; bitpos: [22]; default: 0;
         *  write 1 to clear gamma frame done
         */
        uint32_t gamma_frame_int_clr:1;
        /** rgb2yuv_frame_int_clr : WT; bitpos: [23]; default: 0;
         *  write 1 to clear rgb2yuv frame done
         */
        uint32_t rgb2yuv_frame_int_clr:1;
        /** sharp_frame_int_clr : WT; bitpos: [24]; default: 0;
         *  write 1 to clear sharp frame done
         */
        uint32_t sharp_frame_int_clr:1;
        /** color_frame_int_clr : WT; bitpos: [25]; default: 0;
         *  write 1 to clear color frame done
         */
        uint32_t color_frame_int_clr:1;
        /** yuv2rgb_frame_int_clr : WT; bitpos: [26]; default: 0;
         *  write 1 to clear yuv2rgb frame done
         */
        uint32_t yuv2rgb_frame_int_clr:1;
        /** tail_idi_frame_int_clr : WT; bitpos: [27]; default: 0;
         *  write 1 to clear isp_tail idi frame_end
         */
        uint32_t tail_idi_frame_int_clr:1;
        /** header_idi_frame_int_clr : WT; bitpos: [28]; default: 0;
         *  write 1 to clear real input frame end of isp_input
         */
        uint32_t header_idi_frame_int_clr:1;
        /** crop_frame_int_clr : WT; bitpos: [29]; default: 0;
         *  write 1 to clear crop frame done
         */
        uint32_t crop_frame_int_clr:1;
        /** wbg_frame_int_clr : WT; bitpos: [30]; default: 0;
         *  write 1 to clear wbg frame done
         */
        uint32_t wbg_frame_int_clr:1;
        /** crop_err_int_clr : WT; bitpos: [31]; default: 0;
         *  write 1 to clear crop error
         */
        uint32_t crop_err_int_clr:1;
    };
    uint32_t val;
} isp_int_clr_reg_t;


typedef struct {
    volatile isp_ver_date_reg_t ver_date;
    volatile isp_clk_en_reg_t clk_en;
    volatile isp_cntl_reg_t cntl;
    volatile isp_hsync_cnt_reg_t hsync_cnt;
    volatile isp_frame_cfg_reg_t frame_cfg;
    volatile isp_ccm_coef0_reg_t ccm_coef0;
    volatile isp_ccm_coef1_reg_t ccm_coef1;
    volatile isp_ccm_coef3_reg_t ccm_coef3;
    volatile isp_ccm_coef4_reg_t ccm_coef4;
    volatile isp_ccm_coef5_reg_t ccm_coef5;
    volatile isp_bf_matrix_ctrl_reg_t bf_matrix_ctrl;
    volatile isp_bf_sigma_reg_t bf_sigma;
    volatile isp_bf_gau0_reg_t bf_gau0;
    volatile isp_bf_gau1_reg_t bf_gau1;
    volatile isp_dpc_ctrl_reg_t dpc_ctrl;
    volatile isp_dpc_conf_reg_t dpc_conf;
    volatile isp_dpc_matrix_ctrl_reg_t dpc_matrix_ctrl;
    volatile isp_dpc_deadpix_cnt_reg_t dpc_deadpix_cnt;
    volatile isp_lut_cmd_reg_t lut_cmd;
    volatile isp_lut_wdata_reg_t lut_wdata;
    volatile isp_lut_rdata_reg_t lut_rdata;
    volatile isp_lsc_tablesize_reg_t lsc_tablesize;
    volatile isp_demosaic_matrix_ctrl_reg_t demosaic_matrix_ctrl;
    volatile isp_demosaic_grad_ratio_reg_t demosaic_grad_ratio;
    volatile isp_median_matrix_ctrl_reg_t median_matrix_ctrl;
    volatile isp_int_raw_reg_t int_raw;
    volatile isp_int_st_reg_t int_st;
    volatile isp_int_ena_reg_t int_ena;
    volatile isp_int_clr_reg_t int_clr;
    volatile isp_gamma_ctrl_reg_t gamma_ctrl;
    volatile isp_gamma_ry1_reg_t gamma_ry1;
    volatile isp_gamma_ry2_reg_t gamma_ry2;
    volatile isp_gamma_ry3_reg_t gamma_ry3;
    volatile isp_gamma_ry4_reg_t gamma_ry4;
    volatile isp_gamma_gy1_reg_t gamma_gy1;
    volatile isp_gamma_gy2_reg_t gamma_gy2;
    volatile isp_gamma_gy3_reg_t gamma_gy3;
    volatile isp_gamma_gy4_reg_t gamma_gy4;
    volatile isp_gamma_by1_reg_t gamma_by1;
    volatile isp_gamma_by2_reg_t gamma_by2;
    volatile isp_gamma_by3_reg_t gamma_by3;
    volatile isp_gamma_by4_reg_t gamma_by4;
    volatile isp_gamma_rx1_reg_t gamma_rx1;
    volatile isp_gamma_rx2_reg_t gamma_rx2;
    volatile isp_gamma_gx1_reg_t gamma_gx1;
    volatile isp_gamma_gx2_reg_t gamma_gx2;
    volatile isp_gamma_bx1_reg_t gamma_bx1;
    volatile isp_gamma_bx2_reg_t gamma_bx2;
    volatile isp_ae_ctrl_reg_t ae_ctrl;
    volatile isp_ae_monitor_reg_t ae_monitor;
    volatile isp_ae_bx_reg_t ae_bx;
    volatile isp_ae_by_reg_t ae_by;
    volatile isp_ae_winpixnum_reg_t ae_winpixnum;
    volatile isp_ae_win_reciprocal_reg_t ae_win_reciprocal;
    volatile isp_ae_block_mean_0_reg_t ae_block_mean_0;
    volatile isp_ae_block_mean_1_reg_t ae_block_mean_1;
    volatile isp_ae_block_mean_2_reg_t ae_block_mean_2;
    volatile isp_ae_block_mean_3_reg_t ae_block_mean_3;
    volatile isp_ae_block_mean_4_reg_t ae_block_mean_4;
    volatile isp_ae_block_mean_5_reg_t ae_block_mean_5;
    volatile isp_ae_block_mean_6_reg_t ae_block_mean_6;
    volatile isp_sharp_ctrl0_reg_t sharp_ctrl0;
    volatile isp_sharp_filter0_reg_t sharp_filter0;
    volatile isp_sharp_filter1_reg_t sharp_filter1;
    volatile isp_sharp_filter2_reg_t sharp_filter2;
    volatile isp_sharp_matrix_ctrl_reg_t sharp_matrix_ctrl;
    volatile isp_sharp_ctrl1_reg_t sharp_ctrl1;
    volatile isp_dma_cntl_reg_t dma_cntl;
    volatile isp_dma_raw_data_reg_t dma_raw_data;
    volatile isp_cam_cntl_reg_t cam_cntl;
    volatile isp_cam_conf_reg_t cam_conf;
    volatile isp_af_ctrl0_reg_t af_ctrl0;
    volatile isp_af_ctrl1_reg_t af_ctrl1;
    volatile isp_af_gen_th_ctrl_reg_t af_gen_th_ctrl;
    volatile isp_af_env_user_th_sum_reg_t af_env_user_th_sum;
    volatile isp_af_env_user_th_lum_reg_t af_env_user_th_lum;
    volatile isp_af_threshold_reg_t af_threshold;
    volatile isp_af_hscale_a_reg_t af_hscale_a;
    volatile isp_af_vscale_a_reg_t af_vscale_a;
    volatile isp_af_hscale_b_reg_t af_hscale_b;
    volatile isp_af_vscale_b_reg_t af_vscale_b;
    volatile isp_af_hscale_c_reg_t af_hscale_c;
    volatile isp_af_vscale_c_reg_t af_vscale_c;
    volatile isp_af_sum_a_reg_t af_sum_a;
    volatile isp_af_sum_b_reg_t af_sum_b;
    volatile isp_af_sum_c_reg_t af_sum_c;
    volatile isp_af_lum_a_reg_t af_lum_a;
    volatile isp_af_lum_b_reg_t af_lum_b;
    volatile isp_af_lum_c_reg_t af_lum_c;
    volatile isp_awb_mode_reg_t awb_mode;
    volatile isp_awb_hscale_reg_t awb_hscale;
    volatile isp_awb_vscale_reg_t awb_vscale;
    volatile isp_awb_th_lum_reg_t awb_th_lum;
    volatile isp_awb_th_rg_reg_t awb_th_rg;
    volatile isp_awb_th_bg_reg_t awb_th_bg;
    volatile isp_awb0_white_cnt_reg_t awb0_white_cnt;
    volatile isp_awb0_acc_r_reg_t awb0_acc_r;
    volatile isp_awb0_acc_g_reg_t awb0_acc_g;
    volatile isp_awb0_acc_b_reg_t awb0_acc_b;
    volatile isp_color_ctrl_reg_t color_ctrl;
    volatile isp_blc_value_reg_t blc_value;
    volatile isp_blc_ctrl0_reg_t blc_ctrl0;
    volatile isp_blc_ctrl1_reg_t blc_ctrl1;
    volatile isp_blc_ctrl2_reg_t blc_ctrl2;
    volatile isp_blc_mean_reg_t blc_mean;
    volatile isp_hist_mode_reg_t hist_mode;
    volatile isp_hist_coeff_reg_t hist_coeff;
    volatile isp_hist_offs_reg_t hist_offs;
    volatile isp_hist_size_reg_t hist_size;
    volatile isp_hist_seg0_reg_t hist_seg0;
    volatile isp_hist_seg1_reg_t hist_seg1;
    volatile isp_hist_seg2_reg_t hist_seg2;
    volatile isp_hist_seg3_reg_t hist_seg3;
    volatile isp_hist_weight0_reg_t hist_weight0;
    volatile isp_hist_weight1_reg_t hist_weight1;
    volatile isp_hist_weight2_reg_t hist_weight2;
    volatile isp_hist_weight3_reg_t hist_weight3;
    volatile isp_hist_weight4_reg_t hist_weight4;
    volatile isp_hist_weight5_reg_t hist_weight5;
    volatile isp_hist_weight6_reg_t hist_weight6;
    volatile isp_hist_bin0_reg_t hist_bin0;
    volatile isp_hist_bin1_reg_t hist_bin1;
    volatile isp_hist_bin2_reg_t hist_bin2;
    volatile isp_hist_bin3_reg_t hist_bin3;
    volatile isp_hist_bin4_reg_t hist_bin4;
    volatile isp_hist_bin5_reg_t hist_bin5;
    volatile isp_hist_bin6_reg_t hist_bin6;
    volatile isp_hist_bin7_reg_t hist_bin7;
    volatile isp_hist_bin8_reg_t hist_bin8;
    volatile isp_hist_bin9_reg_t hist_bin9;
    volatile isp_hist_bin10_reg_t hist_bin10;
    volatile isp_hist_bin11_reg_t hist_bin11;
    volatile isp_hist_bin12_reg_t hist_bin12;
    volatile isp_hist_bin13_reg_t hist_bin13;
    volatile isp_hist_bin14_reg_t hist_bin14;
    volatile isp_hist_bin15_reg_t hist_bin15;
    volatile isp_mem_aux_ctrl_0_reg_t mem_aux_ctrl_0;
    volatile isp_mem_aux_ctrl_1_reg_t mem_aux_ctrl_1;
    volatile isp_mem_aux_ctrl_2_reg_t mem_aux_ctrl_2;
    volatile isp_mem_aux_ctrl_3_reg_t mem_aux_ctrl_3;
    volatile isp_mem_aux_ctrl_4_reg_t mem_aux_ctrl_4;
    volatile isp_yuv_format_reg_t yuv_format;
    volatile isp_rdn_eco_cs_reg_t rdn_eco_cs;
    volatile isp_rdn_eco_low_reg_t rdn_eco_low;
    volatile isp_rdn_eco_high_reg_t rdn_eco_high;
    volatile isp_crop_ctrl_reg_t crop_ctrl;
    volatile isp_crop_y_capture_reg_t crop_y_capture;
    volatile isp_crop_x_capture_reg_t crop_x_capture;
    volatile isp_crop_err_st_reg_t crop_err_st;
    volatile isp_wbg_coef_r_reg_t wbg_coef_r;
    volatile isp_wbg_coef_g_reg_t wbg_coef_g;
    volatile isp_wbg_coef_b_reg_t wbg_coef_b;
    volatile isp_color_hue_ctrl_reg_t color_hue_ctrl;
    volatile isp_awb_bx_reg_t awb_bx;
    volatile isp_awb_by_reg_t awb_by;
    volatile isp_state_reg_t state;
    volatile isp_shadow_reg_ctrl_reg_t shadow_reg_ctrl;
} isp_dev_t;

extern isp_dev_t ISP;

#ifndef __cplusplus
_Static_assert(sizeof(isp_dev_t) == 0x274, "Invalid size of isp_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
